openCSMP/openCSMP/lib/samg/samg4.h
//****************************************************************************************
// file: samg.h
// automatically created by tool make_amgparms_user
// created on (yyyy-mm-dd): 2014-11-20, time: 13:48
//****************************************************************************************

// INTERFACE TO FORTRAN90 SAMG4 : amg subroutines have
// to be called as SAMG4_SAMG when this interface is used
// author: Tanja Clees
// last modified: 2011/10/11 AK

////////////
/* Macros */
////////////

/* subroutine naming conventions.
for Unix / Linux: depending on the names of the Fortran symbols in libamg.a,
   choose one of the following macros via a -D option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!):
      SAMG_LCASE
      SAMG_LCASE_USCORE   (see below what they do)
   if none of the above matches the naming conventions for your system,
   define appropriate macros yourself!
*/

/* SAMG_C_CALLCONV: macro (for Windows!) defining the standard calling convention.
   for Unix / Linux: set -DSAMG_UNIX_LINUX as an option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!) */

/* Applications uses 8 Byte integers */
#ifdef INTEGER_SIZE_64
#ifdef _WIN32
#define APPL_INT __int64
#else
#define APPL_INT long int
#endif
#endif

/* default 4 Byte integer types */
#ifndef APPL_INT
#define APPL_INT int
#endif

#if SAMG_UNIX_LINUX
#define SAMG_C_CALLCONV void
#elif SAMG_CVF
// for Compaq Visual Fortran (tested with 6.6 X) :
#define SAMG_C_CALLCONV void __stdcall
#else
// for Intel Visual Fortran (tested with 8.X) :
#define SAMG_C_CALLCONV void __cdecl
#endif


/////////////////////////////////////
/* directives for subroutine names */
/////////////////////////////////////

#ifdef SAMG_LCASE
#define SAMG4 samg4
#define SAMG4_CTIME samg4_ctime
#define SAMG4_CPUTIME samg4_cputime
#define SAMG4_ELAPSED_TIME samg4_elapsed_time
#define SAMG4_ALL_ERRORINFO samg4_all_errorinfo
#define SAMG4_SIMPLE samg4_simple
#define SAMG4_MAIN samg4_main
#define SAMG4_LEAVE samg4_leave
#define SAMG4_REFRESH samg4_refresh
#define SAMG4_CLEANUP samg4_cleanup
#define SAMG4_RESET_HIDDEN samg4_reset_hidden
#define SAMG4_GET_COMPLEXITIES samg4_get_complexities
#define SAMG4_GET_NFLAG samg4_get_nflag
#define SAMG4_SET_NFLAG samg4_set_nflag
#define SAMG4_GET_NFLAGO samg4_get_nflago
#define SAMG4_SET_NFLAGO samg4_set_nflago
#define SAMG4_GET_NFLAGP samg4_get_nflagp
#define SAMG4_SET_NFLAGP samg4_set_nflagp
#define SAMG4_GET_NFLAGS samg4_get_nflags
#define SAMG4_SET_NFLAGS samg4_set_nflags
#define SAMG4_GET_LEVELS_CREATED samg4_get_levels_created
#define SAMG4_GET_LEVELS_USED samg4_get_levels_used
#define SAMG4_GET_LEV_SIZES samg4_get_lev_sizes
#define SAMG4_GET_MEM_ACTIVE samg4_get_mem_active
#define SAMG4_GET_TIME_AND_MEM samg4_get_time_and_mem
#define SAMG4_EXTRAPRINT samg4_extraprint
#define SAMG4_FLUSH samg4_flush
#define SAMG4_CVEC_ALLOC samg4_cvec_alloc
#define SAMG4_CVEC_DEALLOC samg4_cvec_dealloc
#define SAMG4_CVEC_SET samg4_cvec_set
#define SAMG4_CVEC_GET samg4_cvec_get
#define SAMG4_PROPOSE_NSYS_ISCALE_IU samg4_propose_nsys_iscale_iu
#define SAMG4_USED_OMP_THREADS samg4_used_omp_threads
#define SAMG4_GET_INNERMAX samg4_get_innermax
#define SAMG4_SET_INNERMAX samg4_set_innermax
#define SAMG4_DRV_SET_INNERMAX samg4_drv4_set_innermax
#define SAMG4_GET_NUM_SMOOTH_VECTORS samg4_get_num_smooth_vectors
#define SAMG4_SMOOTH_VECTOR_INIT samg4_smooth_vector_init
#define SAMG4_SMOOTH_VECTOR_SET samg4_smooth_vector_set
#define SAMG4_SMOOTH_VECTOR_GET samg4_smooth_vector_get
#define SAMG4_GET_NUM_DEFLATION_VECTORS samg4_get_num_deflation_vectors
#define SAMG4_DEFLATION_VECTOR_INIT samg4_deflation_vector_init
#define SAMG4_DEFLATION_VECTOR_SET samg4_deflation_vector_set
#define SAMG4_DEFLATION_VECTOR_GET samg4_deflation_vector_get
#define SAMG4_USER_CHECK samg4_user_check
#define SAMG4_USER_SOLVE samg4_user_solve
#define SAMG4_USER_CLEANUP samg4_user_cleanup
#define SAMG4_ARRAY_OFFSET samg4_array_offset
#define SAMG4_PERFINIT samg4_perfinit
#define SAMG4_PERFOUT samg4_perfout
#define SAMG4_PARALLEL_LIB samg4_parallel_lib
#define SAMG4_MEM_INFO samg4_mem_info
#define SAMG4_LRATIO samg4_lratio
#define SAMG4_ADDTIME samg4_addtime
#define SAMG4_COMPTIME samg4_comptime
#define SAMG4_COPY_GALERKIN samg4_copy_galerkin
#define SAMG4_OMEGA_JACOBI_ALLOC samg4_omega_jacobi_alloc
#define SAMG4_OMEGA_JACOBI_DEALLOC samg4_omega_jacobi_dealloc
#define SAMG4_OMEGA_JACOBI_SET samg4_omega_jacobi_set
#define SAMG4_CURRENT_RESIDUAL samg4_current_residual
#define SAMG4_OPEN_LOGFILE samg4_open_logfile
#define SAMG4_CLOSE_LOGFILE samg4_close_logfile
#define SAMG4_COO_VEC_SET samg4_coo_vec_set
#define SAMG4_COO_VEC_ALLOC samg4_coo_vec_alloc
#define SAMG4_COO_VEC_DEALLOC samg4_coo_vec_dealloc
#define SAMG4_IDEC samg4_idec
#define SAMG4_DC samg4_dc
#define XSAMG4 xsamg4
#define XSAMG4_DC xsamg4_dc
#define XSAMG4_START xsamg4_start
#define XSAMG4_START_LINUX xsamg4_start_linux
#define XSAMG4_USER_CTRL xsamg4_user_ctrl
#define XSAMG4_START_IUM xsamg4_start_ium
#define XSAMG4_START_SOLVER xsamg4_start_solver
#define XSAMG4_END_SOLVER xsamg4_end_solver
#define XSAMG4_FINALIZE xsamg4_finalize
#define XSAMG4_END xsamg4_end
#define XSAMG4_GET_LOGIO xsamg4_get_logio
#define XSAMG4_GET_SLAVE_RETURNCODE xsamg4_get_slave_returncode
#define XSAMG4_PROCESS_INFO xsamg4_process_info
#define XSAMG4_GET_INTERNAL_TIMER xsamg4_get_internal_timer
#define XSAMG4_MPI_INIT xsamg4_mpi_init
#define XSAMG4_MPI_FINALIZE xsamg4_mpi_finalize
#define XSAMG4_MPI_COMM_RANK xsamg4_mpi_comm_rank
#define XSAMG4_GET_MPI_COMM_WORLD xsamg4_get_mpi_comm_world
#define XSAMG4_GET_PARALLEL_RUN xsamg4_get_parallel_run
#define XSAMG4_IO_SETTINGS xsamg4_io_settings
#define XSAMG4_IO_SETTINGS2 xsamg4_io_settings2
#define XSAMG4_LAST_MSG xsamg4_last_msg
#define XSAMG4_READ_CONFIG xsamg4_read_config
#define XSAMG4_PRINT_INTERNAL_TIMER xsamg4_print_internal_timer
#define XSAMG4_ERROR_INFO xsamg4_error_info
#define XSAMG4_GET_IERR_ON_TAG_STOP xsamg4_get_ierr_on_tag_stop
#define XSAMG4_CONFIGFILE_MISSING xsamg4_configfile_missing
#define XSAMG4_LEAVE xsamg4_leave
#define XSAMG4_CLEANUP xsamg4_cleanup
#define SAMG4_DUMP_SEQUENCE_RESET samg4_dump_sequence_reset
#define SAMG4_GET_RESIDUAL_VECTOR_E samg4_get_residual_vector_e
#define SAMG4_GET_RESIDUAL_VECTOR_V samg4_get_residual_vector_v
#define SAMG4_RESIDUAL_VECTOR_LEAVE samg4_residual_vector_leave
#define SAMG4_SET_RESIDUAL_VECTOR_E samg4_set_residual_vector_e
#define SAMG4_SET_RESIDUAL_VECTOR_V samg4_set_residual_vector_v
#define SAMG4_SET_RESIDUAL_VECTOR_INIT samg4_set_residual_vector_init
#define XSAMG4_OIL xsamg4_oil
#define SAMG4_OIL samg4_oil
#define SAMG4_SET_RENUMBER_VEC samg4_set_renumber_vec
#define SAMG4_GET_RENUMBER_VEC samg4_get_renumber_vec
#define SAMG4_GETRE_NU samg4_getre_nu
#define SAMG4_GETDBLE_NU samg4_getdble_nu
#define SAMG4_GETINT_NU samg4_getint_nu
#define SAMG4_GETTE_NU samg4_gette_nu
#define SAMG4_GETLO_NU samg4_getlo_nu
#define SAMG4_GETSPEC_NU samg4_getspec_nu
#define SAMG4_SET_A_CMPLX_AGG_DEFAULT samg4_set_a_cmplx_agg_default
#define SAMG4_GET_A_CMPLX_AGG_DEFAULT samg4_get_a_cmplx_agg_default
#define SAMG4_SET_A_CMPLX_DEFAULT samg4_set_a_cmplx_default
#define SAMG4_GET_A_CMPLX_DEFAULT samg4_get_a_cmplx_default
#define SAMG4_SET_ALLOW_FILNAM_IN samg4_set_allow_filnam_in
#define SAMG4_GET_ALLOW_FILNAM_IN samg4_get_allow_filnam_in
#define SAMG4_SET_ALLOW_PRIVATE_IN samg4_set_allow_private_in
#define SAMG4_GET_ALLOW_PRIVATE_IN samg4_get_allow_private_in
#define SAMG4_SET_ALLOW_ELIM samg4_set_allow_elim
#define SAMG4_GET_ALLOW_ELIM samg4_get_allow_elim
#define SAMG4_SET_ALLUNS_AT_ALLPNTS samg4_set_alluns_at_allpnts
#define SAMG4_GET_ALLUNS_AT_ALLPNTS samg4_get_alluns_at_allpnts
#define SAMG4_SET_ART_TIME samg4_set_art_time
#define SAMG4_GET_ART_TIME samg4_get_art_time
#define SAMG4_SET_ART_TIME_CYC samg4_set_art_time_cyc
#define SAMG4_GET_ART_TIME_CYC samg4_get_art_time_cyc
#define SAMG4_SET_ART_TIME_CYC_2ND samg4_set_art_time_cyc_2nd
#define SAMG4_GET_ART_TIME_CYC_2ND samg4_get_art_time_cyc_2nd
#define SAMG4_SET_ART_TIME_SETUP samg4_set_art_time_setup
#define SAMG4_GET_ART_TIME_SETUP samg4_get_art_time_setup
#define SAMG4_SET_ART_TIME_SETUP_2ND samg4_set_art_time_setup_2nd
#define SAMG4_GET_ART_TIME_SETUP_2ND samg4_get_art_time_setup_2nd
#define SAMG4_SET_B_CMPLX samg4_set_b_cmplx
#define SAMG4_GET_B_CMPLX samg4_get_b_cmplx
#define SAMG4_SET_B_CMPLX_AGG_DEFAULT samg4_set_b_cmplx_agg_default
#define SAMG4_GET_B_CMPLX_AGG_DEFAULT samg4_get_b_cmplx_agg_default
#define SAMG4_SET_B_CMPLX_DEFAULT samg4_set_b_cmplx_default
#define SAMG4_GET_B_CMPLX_DEFAULT samg4_get_b_cmplx_default
#define SAMG4_SET_BACKUP samg4_set_backup
#define SAMG4_GET_BACKUP samg4_get_backup
#define SAMG4_SET_BLK_FILLEXP samg4_set_blk_fillexp
#define SAMG4_GET_BLK_FILLEXP samg4_get_blk_fillexp
#define SAMG4_SET_BLK_STAB samg4_set_blk_stab
#define SAMG4_GET_BLK_STAB samg4_get_blk_stab
#define SAMG4_SET_BLOCK_SCALE samg4_set_block_scale
#define SAMG4_GET_BLOCK_SCALE samg4_get_block_scale
#define SAMG4_SET_BLOCK_SCALE2 samg4_set_block_scale2
#define SAMG4_GET_BLOCK_SCALE2 samg4_get_block_scale2
#define SAMG4_SET_BLOCK_SCALE3 samg4_set_block_scale3
#define SAMG4_GET_BLOCK_SCALE3 samg4_get_block_scale3
#define SAMG4_SET_BS_AUTO_SIGN samg4_set_bs_auto_sign
#define SAMG4_GET_BS_AUTO_SIGN samg4_get_bs_auto_sign
#define SAMG4_SET_BS_MIN_BLOCK_SIZE samg4_set_bs_min_block_size
#define SAMG4_GET_BS_MIN_BLOCK_SIZE samg4_get_bs_min_block_size
#define SAMG4_SET_BS_OMP samg4_set_bs_omp
#define SAMG4_GET_BS_OMP samg4_get_bs_omp
#define SAMG4_ISET_BND_PARTITION_FILE samg4_iset_bnd_partition_file
#define SAMG4_IGET_BND_PARTITION_FILE samg4_iget_bnd_partition_file
#define SAMG4_SET_BND_PARTITION_FILE samg4_set_bnd_partition_file
#define SAMG4_GET_BND_PARTITION_FILE samg4_get_bnd_partition_file
#define SAMG4_SET_CHECK_ALLPNTS samg4_set_check_allpnts
#define SAMG4_GET_CHECK_ALLPNTS samg4_get_check_allpnts
#define SAMG4_SET_CHECK_ORDER samg4_set_check_order
#define SAMG4_GET_CHECK_ORDER samg4_get_check_order
#define SAMG4_SET_CHECK_BCSR_DUMP samg4_set_check_bcsr_dump
#define SAMG4_GET_CHECK_BCSR_DUMP samg4_get_check_bcsr_dump
#define SAMG4_SET_CL_CPL samg4_set_cl_cpl
#define SAMG4_GET_CL_CPL samg4_get_cl_cpl
#define SAMG4_SET_CL_ORDER samg4_set_cl_order
#define SAMG4_GET_CL_ORDER samg4_get_cl_order
#define SAMG4_SET_CL_OUTRES samg4_set_cl_outres
#define SAMG4_GET_CL_OUTRES samg4_get_cl_outres
#define SAMG4_SET_CL_LEVEL_DEP samg4_set_cl_level_dep
#define SAMG4_GET_CL_LEVEL_DEP samg4_get_cl_level_dep
#define SAMG4_SET_CL_AUTO_SIZE samg4_set_cl_auto_size
#define SAMG4_GET_CL_AUTO_SIZE samg4_get_cl_auto_size
#define SAMG4_SET_CL_PROC_BORDER samg4_set_cl_proc_border
#define SAMG4_GET_CL_PROC_BORDER samg4_get_cl_proc_border
#define SAMG4_SET_CL_QUALITY_MEASURE samg4_set_cl_quality_measure
#define SAMG4_GET_CL_QUALITY_MEASURE samg4_get_cl_quality_measure
#define SAMG4_SET_CL_GLOBAL_QUALITY samg4_set_cl_global_quality
#define SAMG4_GET_CL_GLOBAL_QUALITY samg4_get_cl_global_quality
#define SAMG4_SET_CL_OMP samg4_set_cl_omp
#define SAMG4_GET_CL_OMP samg4_get_cl_omp
#define SAMG4_SET_CL_CMK_REORDER samg4_set_cl_cmk_reorder
#define SAMG4_GET_CL_CMK_REORDER samg4_get_cl_cmk_reorder
#define SAMG4_SET_CLSOLVER_FINEST samg4_set_clsolver_finest
#define SAMG4_GET_CLSOLVER_FINEST samg4_get_clsolver_finest
#define SAMG4_SET_CLDENSE_CTRL samg4_set_cldense_ctrl
#define SAMG4_GET_CLDENSE_CTRL samg4_get_cldense_ctrl
#define SAMG4_SET_CONST_INT_GLK samg4_set_const_int_glk
#define SAMG4_GET_CONST_INT_GLK samg4_get_const_int_glk
#define SAMG4_SET_CONST_INT_SOL samg4_set_const_int_sol
#define SAMG4_GET_CONST_INT_SOL samg4_get_const_int_sol
#define SAMG4_SET_CNTRL_ENFORCE samg4_set_cntrl_enforce
#define SAMG4_GET_CNTRL_ENFORCE samg4_get_cntrl_enforce
#define SAMG4_SET_CNTRL_LOGFILE samg4_set_cntrl_logfile
#define SAMG4_GET_CNTRL_LOGFILE samg4_get_cntrl_logfile
#define SAMG4_SET_CNTRL_METHOD samg4_set_cntrl_method
#define SAMG4_GET_CNTRL_METHOD samg4_get_cntrl_method
#define SAMG4_SET_CNTRL_RELEASE samg4_set_cntrl_release
#define SAMG4_GET_CNTRL_RELEASE samg4_get_cntrl_release
#define SAMG4_SET_CNTRL_RES_DIFF samg4_set_cntrl_res_diff
#define SAMG4_GET_CNTRL_RES_DIFF samg4_get_cntrl_res_diff
#define SAMG4_SET_CNTRL_RETRY_ITER samg4_set_cntrl_retry_iter
#define SAMG4_GET_CNTRL_RETRY_ITER samg4_get_cntrl_retry_iter
#define SAMG4_SET_CNTRL_STEADY samg4_set_cntrl_steady
#define SAMG4_GET_CNTRL_STEADY samg4_get_cntrl_steady
#define SAMG4_SET_CONV_STOP samg4_set_conv_stop
#define SAMG4_GET_CONV_STOP samg4_get_conv_stop
#define SAMG4_SET_CORRECT_CLUSTER_INFO samg4_set_correct_cluster_info
#define SAMG4_GET_CORRECT_CLUSTER_INFO samg4_get_correct_cluster_info
#define SAMG4_SET_CSET_LASTPNT samg4_set_cset_lastpnt
#define SAMG4_GET_CSET_LASTPNT samg4_get_cset_lastpnt
#define SAMG4_SET_CSET_LESSVARS samg4_set_cset_lessvars
#define SAMG4_GET_CSET_LESSVARS samg4_get_cset_lessvars
#define SAMG4_SET_CSET_LONGROW samg4_set_cset_longrow
#define SAMG4_GET_CSET_LONGROW samg4_get_cset_longrow
#define SAMG4_ISET_CSET_READ samg4_iset_cset_read
#define SAMG4_IGET_CSET_READ samg4_iget_cset_read
#define SAMG4_SET_CSET_READ samg4_set_cset_read
#define SAMG4_GET_CSET_READ samg4_get_cset_read
#define SAMG4_SET_CSET_ZERODIAG samg4_set_cset_zerodiag
#define SAMG4_GET_CSET_ZERODIAG samg4_get_cset_zerodiag
#define SAMG4_SET_CSET_UNKNOWN samg4_set_cset_unknown
#define SAMG4_GET_CSET_UNKNOWN samg4_get_cset_unknown
#define SAMG4_SET_CSET_UNKNOWN1 samg4_set_cset_unknown1
#define SAMG4_GET_CSET_UNKNOWN1 samg4_get_cset_unknown1
#define SAMG4_SET_CSET_UNKNOWN2 samg4_set_cset_unknown2
#define SAMG4_GET_CSET_UNKNOWN2 samg4_get_cset_unknown2
#define SAMG4_SET_DELTA_MILU samg4_set_delta_milu
#define SAMG4_GET_DELTA_MILU samg4_get_delta_milu
#define SAMG4_SET_DENSX samg4_set_densx
#define SAMG4_GET_DENSX samg4_get_densx
#define SAMG4_SET_DIVERGENCE samg4_set_divergence
#define SAMG4_GET_DIVERGENCE samg4_get_divergence
#define SAMG4_SET_DIV_STOP_RULE samg4_set_div_stop_rule
#define SAMG4_GET_DIV_STOP_RULE samg4_get_div_stop_rule
#define SAMG4_SET_DIV_THRESHOLD samg4_set_div_threshold
#define SAMG4_GET_DIV_THRESHOLD samg4_get_div_threshold
#define SAMG4_SET_DROPTOL samg4_set_droptol
#define SAMG4_GET_DROPTOL samg4_get_droptol
#define SAMG4_SET_DROPTOL_CL samg4_set_droptol_cl
#define SAMG4_GET_DROPTOL_CL samg4_get_droptol_cl
#define SAMG4_SET_DROPTOL_2ND samg4_set_droptol_2nd
#define SAMG4_GET_DROPTOL_2ND samg4_get_droptol_2nd
#define SAMG4_SET_DROPTOL_SMO samg4_set_droptol_smo
#define SAMG4_GET_DROPTOL_SMO samg4_get_droptol_smo
#define SAMG4_SET_DUMP_APPROX_SOLUTION samg4_set_dump_approx_solution
#define SAMG4_GET_DUMP_APPROX_SOLUTION samg4_get_dump_approx_solution
#define SAMG4_SET_DUMP_CORRECTW samg4_set_dump_correctw
#define SAMG4_GET_DUMP_CORRECTW samg4_get_dump_correctw
#define SAMG4_SET_DUMP_GENERATED_SMOVEC samg4_set_dump_generated_smovec
#define SAMG4_GET_DUMP_GENERATED_SMOVEC samg4_get_dump_generated_smovec
#define SAMG4_SET_ECG samg4_set_ecg
#define SAMG4_GET_ECG samg4_get_ecg
#define SAMG4_SET_ECG_DEFAULT samg4_set_ecg_default
#define SAMG4_GET_ECG_DEFAULT samg4_get_ecg_default
#define SAMG4_SET_ICHOLESKY samg4_set_icholesky
#define SAMG4_GET_ICHOLESKY samg4_get_icholesky
#define SAMG4_SET_ENFORCE_FULLSMO samg4_set_enforce_fullsmo
#define SAMG4_GET_ENFORCE_FULLSMO samg4_get_enforce_fullsmo
#define SAMG4_SET_EPS_ABS samg4_set_eps_abs
#define SAMG4_GET_EPS_ABS samg4_get_eps_abs
#define SAMG4_SET_EPS_ACCEPT_JAC_UZAWA samg4_set_eps_accept_jac_uzawa
#define SAMG4_GET_EPS_ACCEPT_JAC_UZAWA samg4_get_eps_accept_jac_uzawa
#define SAMG4_SET_EPS_CONVERG_JAC_UZAWA samg4_set_eps_converg_jac_uzawa
#define SAMG4_GET_EPS_CONVERG_JAC_UZAWA samg4_get_eps_converg_jac_uzawa
#define SAMG4_SET_EPS_DD samg4_set_eps_dd
#define SAMG4_GET_EPS_DD samg4_get_eps_dd
#define SAMG4_SET_EPS_DIVERG_JAC_UZAWA samg4_set_eps_diverg_jac_uzawa
#define SAMG4_GET_EPS_DIVERG_JAC_UZAWA samg4_get_eps_diverg_jac_uzawa
#define SAMG4_SET_EPS_DIAG samg4_set_eps_diag
#define SAMG4_GET_EPS_DIAG samg4_get_eps_diag
#define SAMG4_SET_EPS_LSQ samg4_set_eps_lsq
#define SAMG4_GET_EPS_LSQ samg4_get_eps_lsq
#define SAMG4_SET_ETR samg4_set_etr
#define SAMG4_GET_ETR samg4_get_etr
#define SAMG4_SET_ETR_DEFAULT samg4_set_etr_default
#define SAMG4_GET_ETR_DEFAULT samg4_get_etr_default
#define SAMG4_SET_ETR2_SMO samg4_set_etr2_smo
#define SAMG4_GET_ETR2_SMO samg4_get_etr2_smo
#define SAMG4_SET_EWT samg4_set_ewt
#define SAMG4_GET_EWT samg4_get_ewt
#define SAMG4_SET_EWT_DEFAULT samg4_set_ewt_default
#define SAMG4_GET_EWT_DEFAULT samg4_get_ewt_default
#define SAMG4_SET_FACTOR_APP_VAR samg4_set_factor_app_var
#define SAMG4_GET_FACTOR_APP_VAR samg4_get_factor_app_var
#define SAMG4_SET_FACTOR_QUASI_RES samg4_set_factor_quasi_res
#define SAMG4_GET_FACTOR_QUASI_RES samg4_get_factor_quasi_res
#define SAMG4_SET_FACTOR_RES_VAR samg4_set_factor_res_var
#define SAMG4_GET_FACTOR_RES_VAR samg4_get_factor_res_var
#define SAMG4_SET_FACTOR_MATRIX_SCALE samg4_set_factor_matrix_scale
#define SAMG4_GET_FACTOR_MATRIX_SCALE samg4_get_factor_matrix_scale
#define SAMG4_SET_FACTOR_SOL_JAC_UZAWA samg4_set_factor_sol_jac_uzawa
#define SAMG4_GET_FACTOR_SOL_JAC_UZAWA samg4_get_factor_sol_jac_uzawa
#define SAMG4_ISET_FILNAM samg4_iset_filnam
#define SAMG4_IGET_FILNAM samg4_iget_filnam
#define SAMG4_SET_FILNAM samg4_set_filnam
#define SAMG4_GET_FILNAM samg4_get_filnam
#define SAMG4_ISET_FILNAM_DUMPSOL samg4_iset_filnam_dumpsol
#define SAMG4_IGET_FILNAM_DUMPSOL samg4_iget_filnam_dumpsol
#define SAMG4_SET_FILNAM_DUMPSOL samg4_set_filnam_dumpsol
#define SAMG4_GET_FILNAM_DUMPSOL samg4_get_filnam_dumpsol
#define SAMG4_ISET_FILNAM_DUMP samg4_iset_filnam_dump
#define SAMG4_IGET_FILNAM_DUMP samg4_iget_filnam_dump
#define SAMG4_SET_FILNAM_DUMP samg4_set_filnam_dump
#define SAMG4_GET_FILNAM_DUMP samg4_get_filnam_dump
#define SAMG4_ISET_FILNAM_UZAWA samg4_iset_filnam_uzawa
#define SAMG4_IGET_FILNAM_UZAWA samg4_iget_filnam_uzawa
#define SAMG4_SET_FILNAM_UZAWA samg4_set_filnam_uzawa
#define SAMG4_GET_FILNAM_UZAWA samg4_get_filnam_uzawa
#define SAMG4_SET_FLEX_PCG_LITE samg4_set_flex_pcg_lite
#define SAMG4_GET_FLEX_PCG_LITE samg4_get_flex_pcg_lite
#define SAMG4_SET_FORCE_ACCEL samg4_set_force_accel
#define SAMG4_GET_FORCE_ACCEL samg4_get_force_accel
#define SAMG4_SET_FORCE_ACCEL_2ND samg4_set_force_accel_2nd
#define SAMG4_GET_FORCE_ACCEL_2ND samg4_get_force_accel_2nd
#define SAMG4_SET_FULL_PIVOTING samg4_set_full_pivoting
#define SAMG4_GET_FULL_PIVOTING samg4_get_full_pivoting
#define SAMG4_SET_FULL_SETUP samg4_set_full_setup
#define SAMG4_GET_FULL_SETUP samg4_get_full_setup
#define SAMG4_SET_G_CMPLX_AGG_DEFAULT samg4_set_g_cmplx_agg_default
#define SAMG4_GET_G_CMPLX_AGG_DEFAULT samg4_get_g_cmplx_agg_default
#define SAMG4_SET_G_CMPLX_DEFAULT samg4_set_g_cmplx_default
#define SAMG4_GET_G_CMPLX_DEFAULT samg4_get_g_cmplx_default
#define SAMG4_SET_GALERKIN_TIMER samg4_set_galerkin_timer
#define SAMG4_GET_GALERKIN_TIMER samg4_get_galerkin_timer
#define SAMG4_SET_GLK_MULT_ZEROS samg4_set_glk_mult_zeros
#define SAMG4_GET_GLK_MULT_ZEROS samg4_get_glk_mult_zeros
#define SAMG4_SET_GMAX_MULTIPASS samg4_set_gmax_multipass
#define SAMG4_GET_GMAX_MULTIPASS samg4_get_gmax_multipass
#define SAMG4_SET_IAGGREGATION_PROFILE samg4_set_iaggregation_profile
#define SAMG4_GET_IAGGREGATION_PROFILE samg4_get_iaggregation_profile
#define SAMG4_SET_IAGGREGATION samg4_set_iaggregation
#define SAMG4_GET_IAGGREGATION samg4_get_iaggregation
#define SAMG4_SET_IALL_SMO samg4_set_iall_smo
#define SAMG4_GET_IALL_SMO samg4_get_iall_smo
#define SAMG4_SET_IAUTO_OMEGA_JACOBI samg4_set_iauto_omega_jacobi
#define SAMG4_GET_IAUTO_OMEGA_JACOBI samg4_get_iauto_omega_jacobi
#define SAMG4_SET_IAUTO_OMEGA_SMOAGG samg4_set_iauto_omega_smoagg
#define SAMG4_GET_IAUTO_OMEGA_SMOAGG samg4_get_iauto_omega_smoagg
#define SAMG4_SET_IAUTO_STOP samg4_set_iauto_stop
#define SAMG4_GET_IAUTO_STOP samg4_get_iauto_stop
#define SAMG4_SET_IDUMP_SEQUENCE_START samg4_set_idump_sequence_start
#define SAMG4_GET_IDUMP_SEQUENCE_START samg4_get_idump_sequence_start
#define SAMG4_SET_IDUMP_SEQUENCE_END samg4_set_idump_sequence_end
#define SAMG4_GET_IDUMP_SEQUENCE_END samg4_get_idump_sequence_end
#define SAMG4_SET_ISTAB_CG samg4_set_istab_cg
#define SAMG4_GET_ISTAB_CG samg4_get_istab_cg
#define SAMG4_SET_IELASTICITY_PROFILE samg4_set_ielasticity_profile
#define SAMG4_GET_IELASTICITY_PROFILE samg4_get_ielasticity_profile
#define SAMG4_SET_IELASTICITY samg4_set_ielasticity
#define SAMG4_GET_IELASTICITY samg4_get_ielasticity
#define SAMG4_SET_IESTIM_SPECT_RADIUS samg4_set_iestim_spect_radius
#define SAMG4_GET_IESTIM_SPECT_RADIUS samg4_get_iestim_spect_radius
#define SAMG4_SET_IESTIM_SMOOTH_NIT samg4_set_iestim_smooth_nit
#define SAMG4_GET_IESTIM_SMOOTH_NIT samg4_get_iestim_smooth_nit
#define SAMG4_SET_INIT_RES_TREATMENT samg4_set_init_res_treatment
#define SAMG4_GET_INIT_RES_TREATMENT samg4_get_init_res_treatment
#define SAMG4_SET_IPRNT_RES_ACCURACY samg4_set_iprnt_res_accuracy
#define SAMG4_GET_IPRNT_RES_ACCURACY samg4_get_iprnt_res_accuracy
#define SAMG4_SET_ISMO2DFL samg4_set_ismo2dfl
#define SAMG4_GET_ISMO2DFL samg4_get_ismo2dfl
#define SAMG4_SET_ISMOAGG_AGGRESSIVE samg4_set_ismoagg_aggressive
#define SAMG4_GET_ISMOAGG_AGGRESSIVE samg4_get_ismoagg_aggressive
#define SAMG4_SET_ISMOAGG_OVERCORRECTION samg4_set_ismoagg_overcorrection
#define SAMG4_GET_ISMOAGG_OVERCORRECTION samg4_get_ismoagg_overcorrection
#define SAMG4_SET_ISMOAGG_OPTIM samg4_set_ismoagg_optim
#define SAMG4_GET_ISMOAGG_OPTIM samg4_get_ismoagg_optim
#define SAMG4_SET_ISMOAGG_BLOCK_TYP samg4_set_ismoagg_block_typ
#define SAMG4_GET_ISMOAGG_BLOCK_TYP samg4_get_ismoagg_block_typ
#define SAMG4_SET_ISMOAGG_COMPRESSION samg4_set_ismoagg_compression
#define SAMG4_GET_ISMOAGG_COMPRESSION samg4_get_ismoagg_compression
#define SAMG4_SET_ISMOAGG_FILTER_TYP samg4_set_ismoagg_filter_typ
#define SAMG4_GET_ISMOAGG_FILTER_TYP samg4_get_ismoagg_filter_typ
#define SAMG4_SET_ISMOAGG_SMOOTH_TYP samg4_set_ismoagg_smooth_typ
#define SAMG4_GET_ISMOAGG_SMOOTH_TYP samg4_get_ismoagg_smooth_typ
#define SAMG4_SET_ISMOAGG_SMOOTH_NIT samg4_set_ismoagg_smooth_nit
#define SAMG4_GET_ISMOAGG_SMOOTH_NIT samg4_get_ismoagg_smooth_nit
#define SAMG4_SET_ISMOAGG_SMOOTH_1LEV samg4_set_ismoagg_smooth_1lev
#define SAMG4_GET_ISMOAGG_SMOOTH_1LEV samg4_get_ismoagg_smooth_1lev
#define SAMG4_SET_ISMOAGG_SMOOTH_NLEV samg4_set_ismoagg_smooth_nlev
#define SAMG4_GET_ISMOAGG_SMOOTH_NLEV samg4_get_ismoagg_smooth_nlev
#define SAMG4_SET_IB_CMPLX samg4_set_ib_cmplx
#define SAMG4_GET_IB_CMPLX samg4_get_ib_cmplx
#define SAMG4_SET_IB_CMPLX_AGG_DEFAULT samg4_set_ib_cmplx_agg_default
#define SAMG4_GET_IB_CMPLX_AGG_DEFAULT samg4_get_ib_cmplx_agg_default
#define SAMG4_SET_IB_CMPLX_DEFAULT samg4_set_ib_cmplx_default
#define SAMG4_GET_IB_CMPLX_DEFAULT samg4_get_ib_cmplx_default
#define SAMG4_SET_IBGS_PIVOT samg4_set_ibgs_pivot
#define SAMG4_GET_IBGS_PIVOT samg4_get_ibgs_pivot
#define SAMG4_SET_ICASE_JAC_UZAWA samg4_set_icase_jac_uzawa
#define SAMG4_GET_ICASE_JAC_UZAWA samg4_get_icase_jac_uzawa
#define SAMG4_SET_ISTATISTICS_SMOVEC samg4_set_istatistics_smovec
#define SAMG4_GET_ISTATISTICS_SMOVEC samg4_get_istatistics_smovec
#define SAMG4_SET_ICHECK_SMOINT samg4_set_icheck_smoint
#define SAMG4_GET_ICHECK_SMOINT samg4_get_icheck_smoint
#define SAMG4_SET_ICOLOR_OMP samg4_set_icolor_omp
#define SAMG4_GET_ICOLOR_OMP samg4_get_icolor_omp
#define SAMG4_SET_IORDERED_OMP samg4_set_iordered_omp
#define SAMG4_GET_IORDERED_OMP samg4_get_iordered_omp
#define SAMG4_SET_ICRITS samg4_set_icrits
#define SAMG4_GET_ICRITS samg4_get_icrits
#define SAMG4_SET_IDTEST_UZAWA samg4_set_idtest_uzawa
#define SAMG4_GET_IDTEST_UZAWA samg4_get_idtest_uzawa
#define SAMG4_SET_IHUGE samg4_set_ihuge
#define SAMG4_GET_IHUGE samg4_get_ihuge
#define SAMG4_SET_IJAC_UZAWA samg4_set_ijac_uzawa
#define SAMG4_GET_IJAC_UZAWA samg4_get_ijac_uzawa
#define SAMG4_SET_ILU4ALLSCHWARZ samg4_set_ilu4allschwarz
