openCSMP/openCSMP/lib/samg/samg4.h
#define SAMG4_GET_ILU4ALLSCHWARZ samg4_get_ilu4allschwarz
#define SAMG4_SET_ILU_SPEED samg4_set_ilu_speed
#define SAMG4_GET_ILU_SPEED samg4_get_ilu_speed
#define SAMG4_SET_IMPLDO_READ_WRITE_LEN samg4_set_impldo_read_write_len
#define SAMG4_GET_IMPLDO_READ_WRITE_LEN samg4_get_impldo_read_write_len
#define SAMG4_SET_INFO_KEEPMEM samg4_set_info_keepmem
#define SAMG4_GET_INFO_KEEPMEM samg4_get_info_keepmem
#define SAMG4_SET_INNER_ACCEL samg4_set_inner_accel
#define SAMG4_GET_INNER_ACCEL samg4_get_inner_accel
#define SAMG4_SET_IODUMP samg4_set_iodump
#define SAMG4_GET_IODUMP samg4_get_iodump
#define SAMG4_ISET_IOFILE_OPTA samg4_iset_iofile_opta
#define SAMG4_IGET_IOFILE_OPTA samg4_iget_iofile_opta
#define SAMG4_SET_IOFILE_OPTA samg4_set_iofile_opta
#define SAMG4_GET_IOFILE_OPTA samg4_get_iofile_opta
#define SAMG4_ISET_IOFORM samg4_iset_ioform
#define SAMG4_IGET_IOFORM samg4_iget_ioform
#define SAMG4_SET_IOFORM samg4_set_ioform
#define SAMG4_GET_IOFORM samg4_get_ioform
#define SAMG4_SET_IOGRID samg4_set_iogrid
#define SAMG4_GET_IOGRID samg4_get_iogrid
#define SAMG4_SET_IOMOVIE samg4_set_iomovie
#define SAMG4_GET_IOMOVIE samg4_get_iomovie
#define SAMG4_SET_IOSCRATCH_DEFAULT samg4_set_ioscratch_default
#define SAMG4_GET_IOSCRATCH_DEFAULT samg4_get_ioscratch_default
#define SAMG4_SET_IOUNIT_OPTA samg4_set_iounit_opta
#define SAMG4_GET_IOUNIT_OPTA samg4_get_iounit_opta
#define SAMG4_SET_IPASS_MAX_SET samg4_set_ipass_max_set
#define SAMG4_GET_IPASS_MAX_SET samg4_get_ipass_max_set
#define SAMG4_SET_IRESTRICTION_OPENMP samg4_set_irestriction_openmp
#define SAMG4_GET_IRESTRICTION_OPENMP samg4_get_irestriction_openmp
#define SAMG4_SET_IPRESSURE_UZAWA samg4_set_ipressure_uzawa
#define SAMG4_GET_IPRESSURE_UZAWA samg4_get_ipressure_uzawa
#define SAMG4_SET_IPROFILE_GEOMETRIC samg4_set_iprofile_geometric
#define SAMG4_GET_IPROFILE_GEOMETRIC samg4_get_iprofile_geometric
#define SAMG4_SET_ISAT_UZAWA samg4_set_isat_uzawa
#define SAMG4_GET_ISAT_UZAWA samg4_get_isat_uzawa
#define SAMG4_SET_ISET_VIO_DD samg4_set_iset_vio_dd
#define SAMG4_GET_ISET_VIO_DD samg4_get_iset_vio_dd
#define SAMG4_SET_ISSTEP_UZAWA samg4_set_isstep_uzawa
#define SAMG4_GET_ISSTEP_UZAWA samg4_get_isstep_uzawa
#define SAMG4_SET_ISTEP1CASE_UZAWA samg4_set_istep1case_uzawa
#define SAMG4_GET_ISTEP1CASE_UZAWA samg4_get_istep1case_uzawa
#define SAMG4_SET_ISTEERING samg4_set_isteering
#define SAMG4_GET_ISTEERING samg4_get_isteering
#define SAMG4_SET_ISWIT3_USER samg4_set_iswit3_user
#define SAMG4_GET_ISWIT3_USER samg4_get_iswit3_user
#define SAMG4_SET_ITER_CHECK samg4_set_iter_check
#define SAMG4_GET_ITER_CHECK samg4_get_iter_check
#define SAMG4_SET_ITER_MATRIX_SCALE samg4_set_iter_matrix_scale
#define SAMG4_GET_ITER_MATRIX_SCALE samg4_get_iter_matrix_scale
#define SAMG4_SET_ITER_PRE samg4_set_iter_pre
#define SAMG4_GET_ITER_PRE samg4_get_iter_pre
#define SAMG4_SET_ITMAX_CONV samg4_set_itmax_conv
#define SAMG4_GET_ITMAX_CONV samg4_get_itmax_conv
#define SAMG4_SET_ITRACE_AMGMAIN samg4_set_itrace_amgmain
#define SAMG4_GET_ITRACE_AMGMAIN samg4_get_itrace_amgmain
#define SAMG4_SET_ITRACELEVEL samg4_set_itracelevel
#define SAMG4_GET_ITRACELEVEL samg4_get_itracelevel
#define SAMG4_SET_ITRACE_CLSOL samg4_set_itrace_clsol
#define SAMG4_GET_ITRACE_CLSOL samg4_get_itrace_clsol
#define SAMG4_SET_ITRACE_CLDENSE samg4_set_itrace_cldense
#define SAMG4_GET_ITRACE_CLDENSE samg4_get_itrace_cldense
#define SAMG4_SET_ITRACE_DIVSTOP samg4_set_itrace_divstop
#define SAMG4_GET_ITRACE_DIVSTOP samg4_get_itrace_divstop
#define SAMG4_SET_ITRACE_JAC_UZAWA samg4_set_itrace_jac_uzawa
#define SAMG4_GET_ITRACE_JAC_UZAWA samg4_get_itrace_jac_uzawa
#define SAMG4_SET_ITRACE_MK_REGULAR samg4_set_itrace_mk_regular
#define SAMG4_GET_ITRACE_MK_REGULAR samg4_get_itrace_mk_regular
#define SAMG4_SET_ITRACE_MATRIX_MODE samg4_set_itrace_matrix_mode
#define SAMG4_GET_ITRACE_MATRIX_MODE samg4_get_itrace_matrix_mode
#define SAMG4_SET_ITRACE_MATRIX_STORAGE samg4_set_itrace_matrix_storage
#define SAMG4_GET_ITRACE_MATRIX_STORAGE samg4_get_itrace_matrix_storage
#define SAMG4_SET_ITRACE_SCHWARZ samg4_set_itrace_schwarz
#define SAMG4_GET_ITRACE_SCHWARZ samg4_get_itrace_schwarz
#define SAMG4_SET_ITRACE_SMO samg4_set_itrace_smo
#define SAMG4_GET_ITRACE_SMO samg4_get_itrace_smo
#define SAMG4_SET_ITRACE_SOL samg4_set_itrace_sol
#define SAMG4_GET_ITRACE_SOL samg4_get_itrace_sol
#define SAMG4_SET_ITRACE_SPLIT samg4_set_itrace_split
#define SAMG4_GET_ITRACE_SPLIT samg4_get_itrace_split
#define SAMG4_SET_ITRACE_UZAWA samg4_set_itrace_uzawa
#define SAMG4_GET_ITRACE_UZAWA samg4_get_itrace_uzawa
#define SAMG4_SET_SMOAGG_NOQR samg4_set_smoagg_noqr
#define SAMG4_GET_SMOAGG_NOQR samg4_get_smoagg_noqr
#define SAMG4_SET_STACKTRACE samg4_set_stacktrace
#define SAMG4_GET_STACKTRACE samg4_get_stacktrace
#define SAMG4_SET_STORE_PGS_FACTOR samg4_set_store_pgs_factor
#define SAMG4_GET_STORE_PGS_FACTOR samg4_get_store_pgs_factor
#define SAMG4_SET_KCYCLE_PROFILE samg4_set_kcycle_profile
#define SAMG4_GET_KCYCLE_PROFILE samg4_get_kcycle_profile
#define SAMG4_SET_KEEPMEM samg4_set_keepmem
#define SAMG4_GET_KEEPMEM samg4_get_keepmem
#define SAMG4_SET_K_DISABLE_KRYLOV1 samg4_set_k_disable_krylov1
#define SAMG4_GET_K_DISABLE_KRYLOV1 samg4_get_k_disable_krylov1
#define SAMG4_SET_K_DYNCYC samg4_set_k_dyncyc
#define SAMG4_GET_K_DYNCYC samg4_get_k_dyncyc
#define SAMG4_SET_LASTGRID samg4_set_lastgrid
#define SAMG4_GET_LASTGRID samg4_get_lastgrid
#define SAMG4_SET_LEV_COARSENING_TOO_SLOW samg4_set_lev_coarsening_too_slow
#define SAMG4_GET_LEV_COARSENING_TOO_SLOW samg4_get_lev_coarsening_too_slow
#define SAMG4_SET_LEVELS_UZAWA samg4_set_levels_uzawa
#define SAMG4_GET_LEVELS_UZAWA samg4_get_levels_uzawa
#define SAMG4_SET_LEVELX samg4_set_levelx
#define SAMG4_GET_LEVELX samg4_get_levelx
#define SAMG4_SET_LEVELX_2ND samg4_set_levelx_2nd
#define SAMG4_GET_LEVELX_2ND samg4_get_levelx_2nd
#define SAMG4_SET_LFIL_CL samg4_set_lfil_cl
#define SAMG4_GET_LFIL_CL samg4_get_lfil_cl
#define SAMG4_SET_LFIL_2ND samg4_set_lfil_2nd
#define SAMG4_GET_LFIL_2ND samg4_get_lfil_2nd
#define SAMG4_SET_LFIL_SMO samg4_set_lfil_smo
#define SAMG4_GET_LFIL_SMO samg4_get_lfil_smo
#define SAMG4_ISET_LOGFILE samg4_iset_logfile
#define SAMG4_IGET_LOGFILE samg4_iget_logfile
#define SAMG4_SET_LOGFILE samg4_set_logfile
#define SAMG4_GET_LOGFILE samg4_get_logfile
#define SAMG4_SET_LOGIO samg4_set_logio
#define SAMG4_GET_LOGIO samg4_get_logio
#define SAMG4_SET_LU_REUSE samg4_set_lu_reuse
#define SAMG4_GET_LU_REUSE samg4_get_lu_reuse
#define SAMG4_SET_MATRIX_MODE samg4_set_matrix_mode
#define SAMG4_GET_MATRIX_MODE samg4_get_matrix_mode
#define SAMG4_SET_MATRIX_FORMAT samg4_set_matrix_format
#define SAMG4_GET_MATRIX_FORMAT samg4_get_matrix_format
#define SAMG4_SET_MATRIX_SCALE_RENORM samg4_set_matrix_scale_renorm
#define SAMG4_GET_MATRIX_SCALE_RENORM samg4_get_matrix_scale_renorm
#define SAMG4_SET_MAX_CALLS samg4_set_max_calls
#define SAMG4_GET_MAX_CALLS samg4_get_max_calls
#define SAMG4_SET_MAX_CL_SIZE samg4_set_max_cl_size
#define SAMG4_GET_MAX_CL_SIZE samg4_get_max_cl_size
#define SAMG4_SET_MAXCORR_CLUSTER samg4_set_maxcorr_cluster
#define SAMG4_GET_MAXCORR_CLUSTER samg4_get_maxcorr_cluster
#define SAMG4_SET_MAX_LEVEL samg4_set_max_level
#define SAMG4_GET_MAX_LEVEL samg4_get_max_level
#define SAMG4_SET_MAX_NB_LIST_SIZE samg4_set_max_nb_list_size
#define SAMG4_GET_MAX_NB_LIST_SIZE samg4_get_max_nb_list_size
#define SAMG4_SET_MAXITER_JAC_UZAWA samg4_set_maxiter_jac_uzawa
#define SAMG4_GET_MAXITER_JAC_UZAWA samg4_get_maxiter_jac_uzawa
#define SAMG4_SET_MAXOP_RESTART samg4_set_maxop_restart
#define SAMG4_GET_MAXOP_RESTART samg4_get_maxop_restart
#define SAMG4_SET_MAXRETRY_JAC_UZAWA samg4_set_maxretry_jac_uzawa
#define SAMG4_GET_MAXRETRY_JAC_UZAWA samg4_get_maxretry_jac_uzawa
#define SAMG4_SET_MILU samg4_set_milu
#define SAMG4_GET_MILU samg4_get_milu
#define SAMG4_SET_MIN_CL_SIZE samg4_set_min_cl_size
#define SAMG4_GET_MIN_CL_SIZE samg4_get_min_cl_size
#define SAMG4_SET_MIN_MULTI_SIZE samg4_set_min_multi_size
#define SAMG4_GET_MIN_MULTI_SIZE samg4_get_min_multi_size
#define SAMG4_SET_MINITER_JAC_UZAWA samg4_set_miniter_jac_uzawa
#define SAMG4_GET_MINITER_JAC_UZAWA samg4_get_miniter_jac_uzawa
#define SAMG4_SET_MK_REGULAR samg4_set_mk_regular
#define SAMG4_GET_MK_REGULAR samg4_get_mk_regular
#define SAMG4_SET_MODE_CNTRL samg4_set_mode_cntrl
#define SAMG4_GET_MODE_CNTRL samg4_get_mode_cntrl
#define SAMG4_SET_MODE_DEBUG samg4_set_mode_debug
#define SAMG4_GET_MODE_DEBUG samg4_get_mode_debug
#define SAMG4_SET_MODE_MESS samg4_set_mode_mess
#define SAMG4_GET_MODE_MESS samg4_get_mode_mess
#define SAMG4_SET_MODIFY_MAT samg4_set_modify_mat
#define SAMG4_GET_MODIFY_MAT samg4_get_modify_mat
#define SAMG4_SET_MODIFY_RESTRICTION samg4_set_modify_restriction
#define SAMG4_GET_MODIFY_RESTRICTION samg4_get_modify_restriction
#define SAMG4_SET_MULTIPASS_ALLCOUP samg4_set_multipass_allcoup
#define SAMG4_GET_MULTIPASS_ALLCOUP samg4_get_multipass_allcoup
#define SAMG4_SET_NBLK_DEBUG samg4_set_nblk_debug
#define SAMG4_GET_NBLK_DEBUG samg4_get_nblk_debug
#define SAMG4_SET_NBLK_MAX samg4_set_nblk_max
#define SAMG4_GET_NBLK_MAX samg4_get_nblk_max
#define SAMG4_SET_NBLK_OVERLAP samg4_set_nblk_overlap
#define SAMG4_GET_NBLK_OVERLAP samg4_get_nblk_overlap
#define SAMG4_SET_NBLK_RESID samg4_set_nblk_resid
#define SAMG4_GET_NBLK_RESID samg4_get_nblk_resid
#define SAMG4_SET_NBLK_SOLVE samg4_set_nblk_solve
#define SAMG4_GET_NBLK_SOLVE samg4_get_nblk_solve
#define SAMG4_SET_NBLK_SOLVER samg4_set_nblk_solver
#define SAMG4_GET_NBLK_SOLVER samg4_get_nblk_solver
#define SAMG4_SET_NBND_OMEGA samg4_set_nbnd_omega
#define SAMG4_GET_NBND_OMEGA samg4_get_nbnd_omega
#define SAMG4_SET_NBND_OMEGA_UZAWA samg4_set_nbnd_omega_uzawa
#define SAMG4_GET_NBND_OMEGA_UZAWA samg4_get_nbnd_omega_uzawa
#define SAMG4_SET_NBND_SWEEPS samg4_set_nbnd_sweeps
#define SAMG4_GET_NBND_SWEEPS samg4_get_nbnd_sweeps
#define SAMG4_SET_NBND_SWEEPS_UZAWA samg4_set_nbnd_sweeps_uzawa
#define SAMG4_GET_NBND_SWEEPS_UZAWA samg4_get_nbnd_sweeps_uzawa
#define SAMG4_SET_NCOLOR_BLOCK_GS samg4_set_ncolor_block_gs
#define SAMG4_GET_NCOLOR_BLOCK_GS samg4_get_ncolor_block_gs
#define SAMG4_SET_NCOLOR_BLOCK_GS_MSG samg4_set_ncolor_block_gs_msg
#define SAMG4_GET_NCOLOR_BLOCK_GS_MSG samg4_get_ncolor_block_gs_msg
#define SAMG4_SET_NCOLOR_BLOCK_GS_RESCHK samg4_set_ncolor_block_gs_reschk
#define SAMG4_GET_NCOLOR_BLOCK_GS_RESCHK samg4_get_ncolor_block_gs_reschk
#define SAMG4_SET_NDEGREE_CHEBY samg4_set_ndegree_cheby
#define SAMG4_GET_NDEGREE_CHEBY samg4_get_ndegree_cheby
#define SAMG4_SET_NCFRAMES samg4_set_ncframes
#define SAMG4_GET_NCFRAMES samg4_get_ncframes
#define SAMG4_SET_NCG samg4_set_ncg
#define SAMG4_GET_NCG samg4_get_ncg
#define SAMG4_SET_NCGRAD_DEFAULT samg4_set_ncgrad_default
#define SAMG4_GET_NCGRAD_DEFAULT samg4_get_ncgrad_default
#define SAMG4_SET_NCYC_DEFAULT samg4_set_ncyc_default
#define SAMG4_GET_NCYC_DEFAULT samg4_get_ncyc_default
#define SAMG4_SET_NCYC_MIN samg4_set_ncyc_min
#define SAMG4_GET_NCYC_MIN samg4_get_ncyc_min
#define SAMG4_SET_NCYC_2ND samg4_set_ncyc_2nd
#define SAMG4_GET_NCYC_2ND samg4_get_ncyc_2nd
#define SAMG4_SET_NCYC_START samg4_set_ncyc_start
#define SAMG4_GET_NCYC_START samg4_get_ncyc_start
#define SAMG4_SET_NDYN_SMO samg4_set_ndyn_smo
#define SAMG4_GET_NDYN_SMO samg4_get_ndyn_smo
#define SAMG4_SET_NEG_DIAG samg4_set_neg_diag
#define SAMG4_GET_NEG_DIAG samg4_get_neg_diag
#define SAMG4_SET_NEG_DIAG_BRUTE samg4_set_neg_diag_brute
#define SAMG4_GET_NEG_DIAG_BRUTE samg4_get_neg_diag_brute
#define SAMG4_SET_NEW_ENTRIES samg4_set_new_entries
#define SAMG4_GET_NEW_ENTRIES samg4_get_new_entries
#define SAMG4_SET_NEW_TOPOLOGY samg4_set_new_topology
#define SAMG4_GET_NEW_TOPOLOGY samg4_get_new_topology
#define SAMG4_SET_NILU_REORDER samg4_set_nilu_reorder
#define SAMG4_GET_NILU_REORDER samg4_get_nilu_reorder
#define SAMG4_SET_NINCR_RES_ACCEPTED_MG samg4_set_nincr_res_accepted_mg
#define SAMG4_GET_NINCR_RES_ACCEPTED_MG samg4_get_nincr_res_accepted_mg
#define SAMG4_SET_NINCR_RES_ACCEPTED_1G samg4_set_nincr_res_accepted_1g
#define SAMG4_GET_NINCR_RES_ACCEPTED_1G samg4_get_nincr_res_accepted_1g
#define SAMG4_SET_NINT_ROWSUM1 samg4_set_nint_rowsum1
#define SAMG4_GET_NINT_ROWSUM1 samg4_get_nint_rowsum1
#define SAMG4_SET_NINTER_OMP samg4_set_ninter_omp
#define SAMG4_GET_NINTER_OMP samg4_get_ninter_omp
#define SAMG4_SET_NITER_SKIP samg4_set_niter_skip
#define SAMG4_GET_NITER_SKIP samg4_get_niter_skip
#define SAMG4_SET_NKCYCLE samg4_set_nkcycle
#define SAMG4_GET_NKCYCLE samg4_get_nkcycle
#define SAMG4_SET_NKDIM_DEFAULT samg4_set_nkdim_default
#define SAMG4_GET_NKDIM_DEFAULT samg4_get_nkdim_default
#define SAMG4_SET_NSMOOTH_COO_POLY samg4_set_nsmooth_coo_poly
#define SAMG4_GET_NSMOOTH_COO_POLY samg4_get_nsmooth_coo_poly
#define SAMG4_SET_NSMOAGG samg4_set_nsmoagg
#define SAMG4_GET_NSMOAGG samg4_get_nsmoagg
#define SAMG4_SET_NSMOAGG1LEV samg4_set_nsmoagg1lev
#define SAMG4_GET_NSMOAGG1LEV samg4_get_nsmoagg1lev
#define SAMG4_SET_NSMOAGGLEV samg4_set_nsmoagglev
#define SAMG4_GET_NSMOAGGLEV samg4_get_nsmoagglev
#define SAMG4_SET_NMIN_MATRIX samg4_set_nmin_matrix
#define SAMG4_GET_NMIN_MATRIX samg4_get_nmin_matrix
#define SAMG4_SET_NMIN_MATRIX_RESC samg4_set_nmin_matrix_resc
#define SAMG4_GET_NMIN_MATRIX_RESC samg4_get_nmin_matrix_resc
#define SAMG4_SET_NMIN_VECTOR samg4_set_nmin_vector
#define SAMG4_GET_NMIN_VECTOR samg4_get_nmin_vector
#define SAMG4_SET_NOTALLUNS_CHEAP samg4_set_notalluns_cheap
#define SAMG4_GET_NOTALLUNS_CHEAP samg4_get_notalluns_cheap
#define SAMG4_SET_NP_MOD1 samg4_set_np_mod1
#define SAMG4_GET_NP_MOD1 samg4_get_np_mod1
#define SAMG4_SET_NP_MOD2 samg4_set_np_mod2
#define SAMG4_GET_NP_MOD2 samg4_get_np_mod2
#define SAMG4_SET_NP_OPT samg4_set_np_opt
#define SAMG4_GET_NP_OPT samg4_get_np_opt
#define SAMG4_SET_NPRIM_AT_ALLPNTS samg4_set_nprim_at_allpnts
#define SAMG4_GET_NPRIM_AT_ALLPNTS samg4_get_nprim_at_allpnts
#define SAMG4_SET_NPTMAX samg4_set_nptmax
#define SAMG4_GET_NPTMAX samg4_get_nptmax
#define SAMG4_SET_NPTMN samg4_set_nptmn
#define SAMG4_GET_NPTMN samg4_get_nptmn
#define SAMG4_SET_NRC samg4_set_nrc
#define SAMG4_GET_NRC samg4_get_nrc
#define SAMG4_SET_NRC_EMERGENCY samg4_set_nrc_emergency
#define SAMG4_GET_NRC_EMERGENCY samg4_get_nrc_emergency
#define SAMG4_SET_NRD samg4_set_nrd
#define SAMG4_GET_NRD samg4_get_nrd
#define SAMG4_SET_NRD_2ND samg4_set_nrd_2nd
#define SAMG4_GET_NRD_2ND samg4_get_nrd_2nd
#define SAMG4_SET_NRU samg4_set_nru
#define SAMG4_GET_NRU samg4_get_nru
#define SAMG4_SET_NRU_2ND samg4_set_nru_2nd
#define SAMG4_GET_NRU_2ND samg4_get_nru_2nd
#define SAMG4_SET_NSIMPLE_EMERGENCY samg4_set_nsimple_emergency
#define SAMG4_GET_NSIMPLE_EMERGENCY samg4_get_nsimple_emergency
#define SAMG4_SET_NSOLVE_DEFAULT samg4_set_nsolve_default
#define SAMG4_GET_NSOLVE_DEFAULT samg4_get_nsolve_default
#define SAMG4_SET_NSOLVE_2ND samg4_set_nsolve_2nd
#define SAMG4_GET_NSOLVE_2ND samg4_get_nsolve_2nd
#define SAMG4_SET_NSOLVE_UZAWA samg4_set_nsolve_uzawa
#define SAMG4_GET_NSOLVE_UZAWA samg4_get_nsolve_uzawa
#define SAMG4_SET_NSTAR_TYP samg4_set_nstar_typ
#define SAMG4_GET_NSTAR_TYP samg4_get_nstar_typ
#define SAMG4_SET_NSW_OMEGA_UZAWA samg4_set_nsw_omega_uzawa
#define SAMG4_GET_NSW_OMEGA_UZAWA samg4_get_nsw_omega_uzawa
#define SAMG4_SET_NSW_UZAWA samg4_set_nsw_uzawa
#define SAMG4_GET_NSW_UZAWA samg4_get_nsw_uzawa
#define SAMG4_SET_NTAKE_RES_IN samg4_set_ntake_res_in
#define SAMG4_GET_NTAKE_RES_IN samg4_get_ntake_res_in
#define SAMG4_SET_NTH_RES_SCRATCH samg4_set_nth_res_scratch
#define SAMG4_GET_NTH_RES_SCRATCH samg4_get_nth_res_scratch
#define SAMG4_SET_NTR samg4_set_ntr
#define SAMG4_GET_NTR samg4_get_ntr
#define SAMG4_SET_NTR_PRIM samg4_set_ntr_prim
#define SAMG4_GET_NTR_PRIM samg4_get_ntr_prim
#define SAMG4_SET_NTYP_ACCEL samg4_set_ntyp_accel
#define SAMG4_GET_NTYP_ACCEL samg4_get_ntyp_accel
#define SAMG4_SET_NTYP_GALERKIN samg4_set_ntyp_galerkin
#define SAMG4_GET_NTYP_GALERKIN samg4_get_ntyp_galerkin
#define SAMG4_SET_NUMTRY_MAX_SET samg4_set_numtry_max_set
#define SAMG4_GET_NUMTRY_MAX_SET samg4_get_numtry_max_set
#define SAMG4_SET_NVERSION samg4_set_nversion
#define SAMG4_GET_NVERSION samg4_get_nversion
#define SAMG4_SET_NWT samg4_set_nwt
#define SAMG4_GET_NWT samg4_get_nwt
#define SAMG4_SET_NXTYP_COARSE samg4_set_nxtyp_coarse
#define SAMG4_GET_NXTYP_COARSE samg4_get_nxtyp_coarse
#define SAMG4_SET_OIL_ACCEL samg4_set_oil_accel
#define SAMG4_GET_OIL_ACCEL samg4_get_oil_accel
#define SAMG4_SET_OIL_GPRS samg4_set_oil_gprs
#define SAMG4_GET_OIL_GPRS samg4_get_oil_gprs
#define SAMG4_SET_OIL_NOPRIM samg4_set_oil_noprim
#define SAMG4_GET_OIL_NOPRIM samg4_get_oil_noprim
#define SAMG4_SET_OMEGA_JAC_ES_UZAWA samg4_set_omega_jac_es_uzawa
#define SAMG4_GET_OMEGA_JAC_ES_UZAWA samg4_get_omega_jac_es_uzawa
#define SAMG4_SET_OMEGA_JAC_P_UZAWA samg4_set_omega_jac_p_uzawa
#define SAMG4_GET_OMEGA_JAC_P_UZAWA samg4_get_omega_jac_p_uzawa
#define SAMG4_SET_OMEGA_JACOBI samg4_set_omega_jacobi
#define SAMG4_GET_OMEGA_JACOBI samg4_get_omega_jacobi
#define SAMG4_SET_OMEGA_SOR_DO samg4_set_omega_sor_do
#define SAMG4_GET_OMEGA_SOR_DO samg4_get_omega_sor_do
#define SAMG4_SET_OMEGA_SOR_UP samg4_set_omega_sor_up
#define SAMG4_GET_OMEGA_SOR_UP samg4_get_omega_sor_up
#define SAMG4_SET_OMEGA_SMO samg4_set_omega_smo
#define SAMG4_GET_OMEGA_SMO samg4_get_omega_smo
#define SAMG4_SET_OMEGA_SMO_MIN samg4_set_omega_smo_min
#define SAMG4_GET_OMEGA_SMO_MIN samg4_get_omega_smo_min
#define SAMG4_SET_OMEGA_UZAWA samg4_set_omega_uzawa
#define SAMG4_GET_OMEGA_UZAWA samg4_get_omega_uzawa
#define SAMG4_SET_OMP_ILU samg4_set_omp_ilu
#define SAMG4_GET_OMP_ILU samg4_get_omp_ilu
#define SAMG4_ISET_OMP_PARTITION_FILE samg4_iset_omp_partition_file
#define SAMG4_IGET_OMP_PARTITION_FILE samg4_iget_omp_partition_file
#define SAMG4_SET_OMP_PARTITION_FILE samg4_set_omp_partition_file
#define SAMG4_GET_OMP_PARTITION_FILE samg4_get_omp_partition_file
#define SAMG4_SET_OMP_NUM_THREADS_EXTERNAL samg4_set_omp_num_threads_external
#define SAMG4_GET_OMP_NUM_THREADS_EXTERNAL samg4_get_omp_num_threads_external
#define SAMG4_SET_OMP_NTHREADS_ONLY4SPLIT samg4_set_omp_nthreads_only4split
#define SAMG4_GET_OMP_NTHREADS_ONLY4SPLIT samg4_get_omp_nthreads_only4split
#define SAMG4_SET_OMP_UZAWA samg4_set_omp_uzawa
#define SAMG4_GET_OMP_UZAWA samg4_get_omp_uzawa
#define SAMG4_SET_OPT_MATRIX_OPS samg4_set_opt_matrix_ops
#define SAMG4_GET_OPT_MATRIX_OPS samg4_get_opt_matrix_ops
#define SAMG4_SET_P_CMPLX_AGG_DEFAULT samg4_set_p_cmplx_agg_default
#define SAMG4_GET_P_CMPLX_AGG_DEFAULT samg4_get_p_cmplx_agg_default
#define SAMG4_SET_P_CMPLX_DEFAULT samg4_set_p_cmplx_default
#define SAMG4_GET_P_CMPLX_DEFAULT samg4_get_p_cmplx_default
#define SAMG4_SET_PARTIAL_FRAC samg4_set_partial_frac
#define SAMG4_GET_PARTIAL_FRAC samg4_get_partial_frac
#define SAMG4_ISET_PARTITION_FILE samg4_iset_partition_file
#define SAMG4_IGET_PARTITION_FILE samg4_iget_partition_file
#define SAMG4_SET_PARTITION_FILE samg4_set_partition_file
#define SAMG4_GET_PARTITION_FILE samg4_get_partition_file
#define SAMG4_SET_AMG_RENUMBER samg4_set_amg_renumber
#define SAMG4_GET_AMG_RENUMBER samg4_get_amg_renumber
#define SAMG4_ISET_AMG_RENUMBER_FILE samg4_iset_amg_renumber_file
#define SAMG4_IGET_AMG_RENUMBER_FILE samg4_iget_amg_renumber_file
#define SAMG4_SET_AMG_RENUMBER_FILE samg4_set_amg_renumber_file
#define SAMG4_GET_AMG_RENUMBER_FILE samg4_get_amg_renumber_file
#define SAMG4_ISET_DUMPFILE_RENUMBER samg4_iset_dumpfile_renumber
#define SAMG4_IGET_DUMPFILE_RENUMBER samg4_iget_dumpfile_renumber
#define SAMG4_SET_DUMPFILE_RENUMBER samg4_set_dumpfile_renumber
#define SAMG4_GET_DUMPFILE_RENUMBER samg4_get_dumpfile_renumber
#define SAMG4_SET_PERF_METER_ENABLED samg4_set_perf_meter_enabled
#define SAMG4_GET_PERF_METER_ENABLED samg4_get_perf_meter_enabled
#define SAMG4_SET_PRIM_NORM samg4_set_prim_norm
#define SAMG4_GET_PRIM_NORM samg4_get_prim_norm
#define SAMG4_SET_PRIM_PRINT samg4_set_prim_print
#define SAMG4_GET_PRIM_PRINT samg4_get_prim_print
#define SAMG4_SET_PRINT_NXTYP_COARSE_MSG samg4_set_print_nxtyp_coarse_msg
#define SAMG4_GET_PRINT_NXTYP_COARSE_MSG samg4_get_print_nxtyp_coarse_msg
#define SAMG4_SET_PRINT_SETUP_ILU_OR_DIRECT samg4_set_print_setup_ilu_or_direct
#define SAMG4_GET_PRINT_SETUP_ILU_OR_DIRECT samg4_get_print_setup_ilu_or_direct
#define SAMG4_SET_PRNT_STAT_SCHWARZ samg4_set_prnt_stat_schwarz
#define SAMG4_GET_PRNT_STAT_SCHWARZ samg4_get_prnt_stat_schwarz
#define SAMG4_SET_QUASI_ONLY samg4_set_quasi_only
#define SAMG4_GET_QUASI_ONLY samg4_get_quasi_only
#define SAMG4_SET_REDUCT_KCYCLE samg4_set_reduct_kcycle
#define SAMG4_GET_REDUCT_KCYCLE samg4_get_reduct_kcycle
#define SAMG4_SET_RBM_INTERN_INFO samg4_set_rbm_intern_info
#define SAMG4_GET_RBM_INTERN_INFO samg4_get_rbm_intern_info
#define SAMG4_SET_RCONDX samg4_set_rcondx
#define SAMG4_GET_RCONDX samg4_get_rcondx
#define SAMG4_SET_READ_UZAWA_PARMS samg4_set_read_uzawa_parms
#define SAMG4_GET_READ_UZAWA_PARMS samg4_get_read_uzawa_parms
#define SAMG4_SET_READ_MARIAN_COARSENING samg4_set_read_marian_coarsening
#define SAMG4_GET_READ_MARIAN_COARSENING samg4_get_read_marian_coarsening
#define SAMG4_SET_REFRESH_CALLED samg4_set_refresh_called
#define SAMG4_GET_REFRESH_CALLED samg4_get_refresh_called
#define SAMG4_SET_REL_APP_VAR samg4_set_rel_app_var
#define SAMG4_GET_REL_APP_VAR samg4_get_rel_app_var
#define SAMG4_SET_RHO_MIN samg4_set_rho_min
#define SAMG4_GET_RHO_MIN samg4_get_rho_min
#define SAMG4_SET_RHO_OK samg4_set_rho_ok
#define SAMG4_GET_RHO_OK samg4_get_rho_ok
#define SAMG4_SET_SHOW_UN_RES samg4_set_show_un_res
#define SAMG4_GET_SHOW_UN_RES samg4_get_show_un_res
#define SAMG4_ISET_SCRATCHFILE samg4_iset_scratchfile
#define SAMG4_IGET_SCRATCHFILE samg4_iget_scratchfile
#define SAMG4_SET_SCRATCHFILE samg4_set_scratchfile
#define SAMG4_GET_SCRATCHFILE samg4_get_scratchfile
#define SAMG4_SET_SLOW_COARSENING samg4_set_slow_coarsening
#define SAMG4_GET_SLOW_COARSENING samg4_get_slow_coarsening
#define SAMG4_SET_STABILITY samg4_set_stability
#define SAMG4_GET_STABILITY samg4_get_stability
#define SAMG4_SET_STRUCT_IDENT samg4_set_struct_ident
#define SAMG4_GET_STRUCT_IDENT samg4_get_struct_ident
#define SAMG4_SET_STRUCT_SYMM samg4_set_struct_symm
#define SAMG4_GET_STRUCT_SYMM samg4_get_struct_symm
#define SAMG4_SET_TAU_UZAWA samg4_set_tau_uzawa
#define SAMG4_GET_TAU_UZAWA samg4_get_tau_uzawa
#define SAMG4_SET_TERM_COARSENING samg4_set_term_coarsening
#define SAMG4_GET_TERM_COARSENING samg4_get_term_coarsening
#define SAMG4_SET_TRACE_L2_QUASI_RES samg4_set_trace_l2_quasi_res
#define SAMG4_GET_TRACE_L2_QUASI_RES samg4_get_trace_l2_quasi_res
#define SAMG4_SET_TRACKMEM samg4_set_trackmem
#define SAMG4_GET_TRACKMEM samg4_get_trackmem
#define SAMG4_SET_TRACKRESID samg4_set_trackresid
#define SAMG4_GET_TRACKRESID samg4_get_trackresid
#define SAMG4_SET_TRACK_AP_P samg4_set_track_ap_p
#define SAMG4_GET_TRACK_AP_P samg4_get_track_ap_p
#define SAMG4_SET_USE_IC samg4_set_use_ic
#define SAMG4_GET_USE_IC samg4_get_use_ic
#define SAMG4_SET_VIO_DD samg4_set_vio_dd
#define SAMG4_GET_VIO_DD samg4_get_vio_dd
#define SAMG4_SET_W_AVRGE_AGG_DEFAULT samg4_set_w_avrge_agg_default
#define SAMG4_GET_W_AVRGE_AGG_DEFAULT samg4_get_w_avrge_agg_default
#define SAMG4_SET_W_AVRGE_DEFAULT samg4_set_w_avrge_default
#define SAMG4_GET_W_AVRGE_DEFAULT samg4_get_w_avrge_default
#define SAMG4_SET_WCOUPLED samg4_set_wcoupled
#define SAMG4_GET_WCOUPLED samg4_get_wcoupled
#define SAMG4_SET_WFT samg4_set_wft
#define SAMG4_GET_WFT samg4_get_wft
#define SAMG4_SET_WLEN_SWITCHES_GALERKIN samg4_set_wlen_switches_galerkin
#define SAMG4_GET_WLEN_SWITCHES_GALERKIN samg4_get_wlen_switches_galerkin
#define SAMG4_SET_WRITE_CLUSTER_ID samg4_set_write_cluster_id
#define SAMG4_GET_WRITE_CLUSTER_ID samg4_get_write_cluster_id
#define SAMG4_SET_WTSL samg4_set_wtsl
#define SAMG4_GET_WTSL samg4_get_wtsl
#define SAMG4_RELEASE_INFO samg4_release_info
#define SAMG4_VERSION_INFO samg4_version_info
#define SAMG4_DETAILS_INFO samg4_details_info
#endif

