openCSMP/openCSMP/lib/samg/samg4.h
#ifdef SAMG_LCASE_USCORE
#define SAMG4 samg4_
#define SAMG4_CTIME samg4_ctime_
#define SAMG4_CPUTIME samg4_cputime_
#define SAMG4_ELAPSED_TIME samg4_elapsed_time_
#define SAMG4_ALL_ERRORINFO samg4_all_errorinfo_
#define SAMG4_SIMPLE samg4_simple_
#define SAMG4_MAIN samg4_main_
#define SAMG4_LEAVE samg4_leave_
#define SAMG4_REFRESH samg4_refresh_
#define SAMG4_CLEANUP samg4_cleanup_
#define SAMG4_RESET_HIDDEN samg4_reset_hidden_
#define SAMG4_GET_COMPLEXITIES samg4_get_complexities_
#define SAMG4_GET_NFLAG samg4_get_nflag_
#define SAMG4_SET_NFLAG samg4_set_nflag_
#define SAMG4_GET_NFLAGO samg4_get_nflago_
#define SAMG4_SET_NFLAGO samg4_set_nflago_
#define SAMG4_GET_NFLAGP samg4_get_nflagp_
#define SAMG4_SET_NFLAGP samg4_set_nflagp_
#define SAMG4_GET_NFLAGS samg4_get_nflags_
#define SAMG4_SET_NFLAGS samg4_set_nflags_
#define SAMG4_GET_LEVELS_CREATED samg4_get_levels_created_
#define SAMG4_GET_LEVELS_USED samg4_get_levels_used_
#define SAMG4_GET_LEV_SIZES samg4_get_lev_sizes_
#define SAMG4_GET_MEM_ACTIVE samg4_get_mem_active_
#define SAMG4_GET_TIME_AND_MEM samg4_get_time_and_mem_
#define SAMG4_EXTRAPRINT samg4_extraprint_
#define SAMG4_FLUSH samg4_flush_
#define SAMG4_CVEC_ALLOC samg4_cvec_alloc_
#define SAMG4_CVEC_DEALLOC samg4_cvec_dealloc_
#define SAMG4_CVEC_SET samg4_cvec_set_
#define SAMG4_CVEC_GET samg4_cvec_get_
#define SAMG4_PROPOSE_NSYS_ISCALE_IU samg4_propose_nsys_iscale_iu_
#define SAMG4_USED_OMP_THREADS samg4_used_omp_threads_
#define SAMG4_GET_INNERMAX samg4_get_innermax_
#define SAMG4_SET_INNERMAX samg4_set_innermax_
#define SAMG4_DRV_SET_INNERMAX samg4_drv4_set_innermax_
#define SAMG4_GET_NUM_SMOOTH_VECTORS samg4_get_num_smooth_vectors_
#define SAMG4_SMOOTH_VECTOR_INIT samg4_smooth_vector_init_
#define SAMG4_SMOOTH_VECTOR_SET samg4_smooth_vector_set_
#define SAMG4_SMOOTH_VECTOR_GET samg4_smooth_vector_get_
#define SAMG4_GET_NUM_DEFLATION_VECTORS samg4_get_num_deflation_vectors_
#define SAMG4_DEFLATION_VECTOR_INIT samg4_deflation_vector_init_
#define SAMG4_DEFLATION_VECTOR_SET samg4_deflation_vector_set_
#define SAMG4_DEFLATION_VECTOR_GET samg4_deflation_vector_get_
#define SAMG4_USER_CHECK samg4_user_check_
#define SAMG4_USER_SOLVE samg4_user_solve_
#define SAMG4_USER_CLEANUP samg4_user_cleanup_
#define SAMG4_ARRAY_OFFSET samg4_array_offset_
#define SAMG4_PERFINIT samg4_perfinit_
#define SAMG4_PERFOUT samg4_perfout_
#define SAMG4_PARALLEL_LIB samg4_parallel_lib_
#define SAMG4_MEM_INFO samg4_mem_info_
#define SAMG4_LRATIO samg4_lratio_
#define SAMG4_ADDTIME samg4_addtime_
#define SAMG4_COMPTIME samg4_comptime_
#define SAMG4_COPY_GALERKIN samg4_copy_galerkin_
#define SAMG4_OMEGA_JACOBI_ALLOC samg4_omega_jacobi_alloc_
#define SAMG4_OMEGA_JACOBI_DEALLOC samg4_omega_jacobi_dealloc_
#define SAMG4_OMEGA_JACOBI_SET samg4_omega_jacobi_set_
#define SAMG4_CURRENT_RESIDUAL samg4_current_residual_
#define SAMG4_OPEN_LOGFILE samg4_open_logfile_
#define SAMG4_CLOSE_LOGFILE samg4_close_logfile_
#define SAMG4_COO_VEC_SET samg4_coo_vec_set_
#define SAMG4_COO_VEC_ALLOC samg4_coo_vec_alloc_
#define SAMG4_COO_VEC_DEALLOC samg4_coo_vec_dealloc_
#define SAMG4_IDEC samg4_idec_
#define SAMG4_DC samg4_dc_
#define XSAMG4 xsamg4_
#define XSAMG4_DC xsamg4_dc_
#define XSAMG4_START xsamg4_start_
#define XSAMG4_START_LINUX xsamg4_start_linux_
#define XSAMG4_USER_CTRL xsamg4_user_ctrl_
#define XSAMG4_START_IUM xsamg4_start_ium_
#define XSAMG4_START_SOLVER xsamg4_start_solver_
#define XSAMG4_END_SOLVER xsamg4_end_solver_
#define XSAMG4_FINALIZE xsamg4_finalize_
#define XSAMG4_END xsamg4_end_
#define XSAMG4_GET_LOGIO xsamg4_get_logio_
#define XSAMG4_GET_SLAVE_RETURNCODE xsamg4_get_slave_returncode_
#define XSAMG4_PROCESS_INFO xsamg4_process_info_
#define XSAMG4_GET_INTERNAL_TIMER xsamg4_get_internal_timer_
#define XSAMG4_MPI_INIT xsamg4_mpi_init_
#define XSAMG4_MPI_FINALIZE xsamg4_mpi_finalize_
#define XSAMG4_MPI_COMM_RANK xsamg4_mpi_comm_rank_
#define XSAMG4_GET_MPI_COMM_WORLD xsamg4_get_mpi_comm_world_
#define XSAMG4_GET_PARALLEL_RUN xsamg4_get_parallel_run_
#define XSAMG4_IO_SETTINGS xsamg4_io_settings_
#define XSAMG4_IO_SETTINGS2 xsamg4_io_settings2_
#define XSAMG4_LAST_MSG xsamg4_last_msg_
#define XSAMG4_READ_CONFIG xsamg4_read_config_
#define XSAMG4_PRINT_INTERNAL_TIMER xsamg4_print_internal_timer_
#define XSAMG4_ERROR_INFO xsamg4_error_info_
#define XSAMG4_GET_IERR_ON_TAG_STOP xsamg4_get_ierr_on_tag_stop_
#define XSAMG4_CONFIGFILE_MISSING xsamg4_configfile_missing_
#define XSAMG4_LEAVE xsamg4_leave_
#define XSAMG4_CLEANUP xsamg4_cleanup_
#define SAMG4_DUMP_SEQUENCE_RESET samg4_dump_sequence_reset_
#define SAMG4_GET_RESIDUAL_VECTOR_E samg4_get_residual_vector_e_
#define SAMG4_GET_RESIDUAL_VECTOR_V samg4_get_residual_vector_v_
#define SAMG4_RESIDUAL_VECTOR_LEAVE samg4_residual_vector_leave_
#define SAMG4_SET_RESIDUAL_VECTOR_E samg4_set_residual_vector_e_
#define SAMG4_SET_RESIDUAL_VECTOR_V samg4_set_residual_vector_v_
#define SAMG4_SET_RESIDUAL_VECTOR_INIT samg4_set_residual_vector_init_
#define XSAMG4_OIL xsamg4_oil_
#define SAMG4_OIL samg4_oil_
#define SAMG4_SET_RENUMBER_VEC samg4_set_renumber_vec_
#define SAMG4_GET_RENUMBER_VEC samg4_get_renumber_vec_
#define SAMG4_GETRE_NU samg4_getre_nu_
#define SAMG4_GETDBLE_NU samg4_getdble_nu_
#define SAMG4_GETINT_NU samg4_getint_nu_
#define SAMG4_GETTE_NU samg4_gette_nu_
#define SAMG4_GETLO_NU samg4_getlo_nu_
#define SAMG4_GETSPEC_NU samg4_getspec_nu_
#define SAMG4_SET_A_CMPLX_AGG_DEFAULT samg4_set_a_cmplx_agg_default_
#define SAMG4_GET_A_CMPLX_AGG_DEFAULT samg4_get_a_cmplx_agg_default_
#define SAMG4_SET_A_CMPLX_DEFAULT samg4_set_a_cmplx_default_
#define SAMG4_GET_A_CMPLX_DEFAULT samg4_get_a_cmplx_default_
#define SAMG4_SET_ALLOW_FILNAM_IN samg4_set_allow_filnam_in_
#define SAMG4_GET_ALLOW_FILNAM_IN samg4_get_allow_filnam_in_
#define SAMG4_SET_ALLOW_PRIVATE_IN samg4_set_allow_private_in_
#define SAMG4_GET_ALLOW_PRIVATE_IN samg4_get_allow_private_in_
#define SAMG4_SET_ALLOW_ELIM samg4_set_allow_elim_
#define SAMG4_GET_ALLOW_ELIM samg4_get_allow_elim_
#define SAMG4_SET_ALLUNS_AT_ALLPNTS samg4_set_alluns_at_allpnts_
#define SAMG4_GET_ALLUNS_AT_ALLPNTS samg4_get_alluns_at_allpnts_
#define SAMG4_SET_ART_TIME samg4_set_art_time_
#define SAMG4_GET_ART_TIME samg4_get_art_time_
#define SAMG4_SET_ART_TIME_CYC samg4_set_art_time_cyc_
#define SAMG4_GET_ART_TIME_CYC samg4_get_art_time_cyc_
#define SAMG4_SET_ART_TIME_CYC_2ND samg4_set_art_time_cyc_2nd_
#define SAMG4_GET_ART_TIME_CYC_2ND samg4_get_art_time_cyc_2nd_
#define SAMG4_SET_ART_TIME_SETUP samg4_set_art_time_setup_
#define SAMG4_GET_ART_TIME_SETUP samg4_get_art_time_setup_
#define SAMG4_SET_ART_TIME_SETUP_2ND samg4_set_art_time_setup_2nd_
#define SAMG4_GET_ART_TIME_SETUP_2ND samg4_get_art_time_setup_2nd_
#define SAMG4_SET_B_CMPLX samg4_set_b_cmplx_
#define SAMG4_GET_B_CMPLX samg4_get_b_cmplx_
#define SAMG4_SET_B_CMPLX_AGG_DEFAULT samg4_set_b_cmplx_agg_default_
#define SAMG4_GET_B_CMPLX_AGG_DEFAULT samg4_get_b_cmplx_agg_default_
#define SAMG4_SET_B_CMPLX_DEFAULT samg4_set_b_cmplx_default_
#define SAMG4_GET_B_CMPLX_DEFAULT samg4_get_b_cmplx_default_
#define SAMG4_SET_BACKUP samg4_set_backup_
#define SAMG4_GET_BACKUP samg4_get_backup_
#define SAMG4_SET_BLK_FILLEXP samg4_set_blk_fillexp_
#define SAMG4_GET_BLK_FILLEXP samg4_get_blk_fillexp_
#define SAMG4_SET_BLK_STAB samg4_set_blk_stab_
#define SAMG4_GET_BLK_STAB samg4_get_blk_stab_
#define SAMG4_SET_BLOCK_SCALE samg4_set_block_scale_
#define SAMG4_GET_BLOCK_SCALE samg4_get_block_scale_
#define SAMG4_SET_BLOCK_SCALE2 samg4_set_block_scale2_
#define SAMG4_GET_BLOCK_SCALE2 samg4_get_block_scale2_
#define SAMG4_SET_BLOCK_SCALE3 samg4_set_block_scale3_
#define SAMG4_GET_BLOCK_SCALE3 samg4_get_block_scale3_
#define SAMG4_SET_BS_AUTO_SIGN samg4_set_bs_auto_sign_
#define SAMG4_GET_BS_AUTO_SIGN samg4_get_bs_auto_sign_
#define SAMG4_SET_BS_MIN_BLOCK_SIZE samg4_set_bs_min_block_size_
#define SAMG4_GET_BS_MIN_BLOCK_SIZE samg4_get_bs_min_block_size_
#define SAMG4_SET_BS_OMP samg4_set_bs_omp_
#define SAMG4_GET_BS_OMP samg4_get_bs_omp_
#define SAMG4_ISET_BND_PARTITION_FILE samg4_iset_bnd_partition_file_
#define SAMG4_IGET_BND_PARTITION_FILE samg4_iget_bnd_partition_file_
#define SAMG4_SET_BND_PARTITION_FILE samg4_set_bnd_partition_file_
#define SAMG4_GET_BND_PARTITION_FILE samg4_get_bnd_partition_file_
#define SAMG4_SET_CHECK_ALLPNTS samg4_set_check_allpnts_
#define SAMG4_GET_CHECK_ALLPNTS samg4_get_check_allpnts_
#define SAMG4_SET_CHECK_ORDER samg4_set_check_order_
#define SAMG4_GET_CHECK_ORDER samg4_get_check_order_
#define SAMG4_SET_CHECK_BCSR_DUMP samg4_set_check_bcsr_dump_
#define SAMG4_GET_CHECK_BCSR_DUMP samg4_get_check_bcsr_dump_
#define SAMG4_SET_CL_CPL samg4_set_cl_cpl_
#define SAMG4_GET_CL_CPL samg4_get_cl_cpl_
#define SAMG4_SET_CL_ORDER samg4_set_cl_order_
#define SAMG4_GET_CL_ORDER samg4_get_cl_order_
#define SAMG4_SET_CL_OUTRES samg4_set_cl_outres_
#define SAMG4_GET_CL_OUTRES samg4_get_cl_outres_
#define SAMG4_SET_CL_LEVEL_DEP samg4_set_cl_level_dep_
#define SAMG4_GET_CL_LEVEL_DEP samg4_get_cl_level_dep_
#define SAMG4_SET_CL_AUTO_SIZE samg4_set_cl_auto_size_
#define SAMG4_GET_CL_AUTO_SIZE samg4_get_cl_auto_size_
#define SAMG4_SET_CL_PROC_BORDER samg4_set_cl_proc_border_
#define SAMG4_GET_CL_PROC_BORDER samg4_get_cl_proc_border_
#define SAMG4_SET_CL_QUALITY_MEASURE samg4_set_cl_quality_measure_
#define SAMG4_GET_CL_QUALITY_MEASURE samg4_get_cl_quality_measure_
#define SAMG4_SET_CL_GLOBAL_QUALITY samg4_set_cl_global_quality_
#define SAMG4_GET_CL_GLOBAL_QUALITY samg4_get_cl_global_quality_
#define SAMG4_SET_CL_OMP samg4_set_cl_omp_
#define SAMG4_GET_CL_OMP samg4_get_cl_omp_
#define SAMG4_SET_CL_CMK_REORDER samg4_set_cl_cmk_reorder_
#define SAMG4_GET_CL_CMK_REORDER samg4_get_cl_cmk_reorder_
#define SAMG4_SET_CLSOLVER_FINEST samg4_set_clsolver_finest_
#define SAMG4_GET_CLSOLVER_FINEST samg4_get_clsolver_finest_
#define SAMG4_SET_CLDENSE_CTRL samg4_set_cldense_ctrl_
#define SAMG4_GET_CLDENSE_CTRL samg4_get_cldense_ctrl_
#define SAMG4_SET_CONST_INT_GLK samg4_set_const_int_glk_
#define SAMG4_GET_CONST_INT_GLK samg4_get_const_int_glk_
#define SAMG4_SET_CONST_INT_SOL samg4_set_const_int_sol_
#define SAMG4_GET_CONST_INT_SOL samg4_get_const_int_sol_
#define SAMG4_SET_CNTRL_ENFORCE samg4_set_cntrl_enforce_
#define SAMG4_GET_CNTRL_ENFORCE samg4_get_cntrl_enforce_
#define SAMG4_SET_CNTRL_LOGFILE samg4_set_cntrl_logfile_
#define SAMG4_GET_CNTRL_LOGFILE samg4_get_cntrl_logfile_
#define SAMG4_SET_CNTRL_METHOD samg4_set_cntrl_method_
#define SAMG4_GET_CNTRL_METHOD samg4_get_cntrl_method_
#define SAMG4_SET_CNTRL_RELEASE samg4_set_cntrl_release_
#define SAMG4_GET_CNTRL_RELEASE samg4_get_cntrl_release_
#define SAMG4_SET_CNTRL_RES_DIFF samg4_set_cntrl_res_diff_
#define SAMG4_GET_CNTRL_RES_DIFF samg4_get_cntrl_res_diff_
#define SAMG4_SET_CNTRL_RETRY_ITER samg4_set_cntrl_retry_iter_
#define SAMG4_GET_CNTRL_RETRY_ITER samg4_get_cntrl_retry_iter_
#define SAMG4_SET_CNTRL_STEADY samg4_set_cntrl_steady_
#define SAMG4_GET_CNTRL_STEADY samg4_get_cntrl_steady_
#define SAMG4_SET_CONV_STOP samg4_set_conv_stop_
#define SAMG4_GET_CONV_STOP samg4_get_conv_stop_
#define SAMG4_SET_CORRECT_CLUSTER_INFO samg4_set_correct_cluster_info_
#define SAMG4_GET_CORRECT_CLUSTER_INFO samg4_get_correct_cluster_info_
#define SAMG4_SET_CSET_LASTPNT samg4_set_cset_lastpnt_
#define SAMG4_GET_CSET_LASTPNT samg4_get_cset_lastpnt_
#define SAMG4_SET_CSET_LESSVARS samg4_set_cset_lessvars_
#define SAMG4_GET_CSET_LESSVARS samg4_get_cset_lessvars_
#define SAMG4_SET_CSET_LONGROW samg4_set_cset_longrow_
#define SAMG4_GET_CSET_LONGROW samg4_get_cset_longrow_
#define SAMG4_ISET_CSET_READ samg4_iset_cset_read_
#define SAMG4_IGET_CSET_READ samg4_iget_cset_read_
#define SAMG4_SET_CSET_READ samg4_set_cset_read_
#define SAMG4_GET_CSET_READ samg4_get_cset_read_
#define SAMG4_SET_CSET_ZERODIAG samg4_set_cset_zerodiag_
#define SAMG4_GET_CSET_ZERODIAG samg4_get_cset_zerodiag_
#define SAMG4_SET_CSET_UNKNOWN samg4_set_cset_unknown_
#define SAMG4_GET_CSET_UNKNOWN samg4_get_cset_unknown_
#define SAMG4_SET_CSET_UNKNOWN1 samg4_set_cset_unknown1_
#define SAMG4_GET_CSET_UNKNOWN1 samg4_get_cset_unknown1_
#define SAMG4_SET_CSET_UNKNOWN2 samg4_set_cset_unknown2_
#define SAMG4_GET_CSET_UNKNOWN2 samg4_get_cset_unknown2_
#define SAMG4_SET_DELTA_MILU samg4_set_delta_milu_
#define SAMG4_GET_DELTA_MILU samg4_get_delta_milu_
#define SAMG4_SET_DENSX samg4_set_densx_
#define SAMG4_GET_DENSX samg4_get_densx_
#define SAMG4_SET_DIVERGENCE samg4_set_divergence_
#define SAMG4_GET_DIVERGENCE samg4_get_divergence_
#define SAMG4_SET_DIV_STOP_RULE samg4_set_div_stop_rule_
#define SAMG4_GET_DIV_STOP_RULE samg4_get_div_stop_rule_
#define SAMG4_SET_DIV_THRESHOLD samg4_set_div_threshold_
#define SAMG4_GET_DIV_THRESHOLD samg4_get_div_threshold_
#define SAMG4_SET_DROPTOL samg4_set_droptol_
#define SAMG4_GET_DROPTOL samg4_get_droptol_
#define SAMG4_SET_DROPTOL_CL samg4_set_droptol_cl_
#define SAMG4_GET_DROPTOL_CL samg4_get_droptol_cl_
#define SAMG4_SET_DROPTOL_2ND samg4_set_droptol_2nd_
#define SAMG4_GET_DROPTOL_2ND samg4_get_droptol_2nd_
#define SAMG4_SET_DROPTOL_SMO samg4_set_droptol_smo_
#define SAMG4_GET_DROPTOL_SMO samg4_get_droptol_smo_
#define SAMG4_SET_DUMP_APPROX_SOLUTION samg4_set_dump_approx_solution_
#define SAMG4_GET_DUMP_APPROX_SOLUTION samg4_get_dump_approx_solution_
#define SAMG4_SET_DUMP_CORRECTW samg4_set_dump_correctw_
#define SAMG4_GET_DUMP_CORRECTW samg4_get_dump_correctw_
#define SAMG4_SET_DUMP_GENERATED_SMOVEC samg4_set_dump_generated_smovec_
#define SAMG4_GET_DUMP_GENERATED_SMOVEC samg4_get_dump_generated_smovec_
#define SAMG4_SET_ECG samg4_set_ecg_
#define SAMG4_GET_ECG samg4_get_ecg_
#define SAMG4_SET_ECG_DEFAULT samg4_set_ecg_default_
#define SAMG4_GET_ECG_DEFAULT samg4_get_ecg_default_
#define SAMG4_SET_ICHOLESKY samg4_set_icholesky_
#define SAMG4_GET_ICHOLESKY samg4_get_icholesky_
#define SAMG4_SET_ENFORCE_FULLSMO samg4_set_enforce_fullsmo_
#define SAMG4_GET_ENFORCE_FULLSMO samg4_get_enforce_fullsmo_
#define SAMG4_SET_EPS_ABS samg4_set_eps_abs_
#define SAMG4_GET_EPS_ABS samg4_get_eps_abs_
#define SAMG4_SET_EPS_ACCEPT_JAC_UZAWA samg4_set_eps_accept_jac_uzawa_
#define SAMG4_GET_EPS_ACCEPT_JAC_UZAWA samg4_get_eps_accept_jac_uzawa_
#define SAMG4_SET_EPS_CONVERG_JAC_UZAWA samg4_set_eps_converg_jac_uzawa_
#define SAMG4_GET_EPS_CONVERG_JAC_UZAWA samg4_get_eps_converg_jac_uzawa_
#define SAMG4_SET_EPS_DD samg4_set_eps_dd_
#define SAMG4_GET_EPS_DD samg4_get_eps_dd_
#define SAMG4_SET_EPS_DIVERG_JAC_UZAWA samg4_set_eps_diverg_jac_uzawa_
#define SAMG4_GET_EPS_DIVERG_JAC_UZAWA samg4_get_eps_diverg_jac_uzawa_
#define SAMG4_SET_EPS_DIAG samg4_set_eps_diag_
#define SAMG4_GET_EPS_DIAG samg4_get_eps_diag_
#define SAMG4_SET_EPS_LSQ samg4_set_eps_lsq_
#define SAMG4_GET_EPS_LSQ samg4_get_eps_lsq_
#define SAMG4_SET_ETR samg4_set_etr_
#define SAMG4_GET_ETR samg4_get_etr_
#define SAMG4_SET_ETR_DEFAULT samg4_set_etr_default_
#define SAMG4_GET_ETR_DEFAULT samg4_get_etr_default_
#define SAMG4_SET_ETR2_SMO samg4_set_etr2_smo_
#define SAMG4_GET_ETR2_SMO samg4_get_etr2_smo_
#define SAMG4_SET_EWT samg4_set_ewt_
#define SAMG4_GET_EWT samg4_get_ewt_
#define SAMG4_SET_EWT_DEFAULT samg4_set_ewt_default_
#define SAMG4_GET_EWT_DEFAULT samg4_get_ewt_default_
#define SAMG4_SET_FACTOR_APP_VAR samg4_set_factor_app_var_
#define SAMG4_GET_FACTOR_APP_VAR samg4_get_factor_app_var_
#define SAMG4_SET_FACTOR_QUASI_RES samg4_set_factor_quasi_res_
#define SAMG4_GET_FACTOR_QUASI_RES samg4_get_factor_quasi_res_
#define SAMG4_SET_FACTOR_RES_VAR samg4_set_factor_res_var_
#define SAMG4_GET_FACTOR_RES_VAR samg4_get_factor_res_var_
#define SAMG4_SET_FACTOR_MATRIX_SCALE samg4_set_factor_matrix_scale_
#define SAMG4_GET_FACTOR_MATRIX_SCALE samg4_get_factor_matrix_scale_
#define SAMG4_SET_FACTOR_SOL_JAC_UZAWA samg4_set_factor_sol_jac_uzawa_
#define SAMG4_GET_FACTOR_SOL_JAC_UZAWA samg4_get_factor_sol_jac_uzawa_
#define SAMG4_ISET_FILNAM samg4_iset_filnam_
#define SAMG4_IGET_FILNAM samg4_iget_filnam_
#define SAMG4_SET_FILNAM samg4_set_filnam_
#define SAMG4_GET_FILNAM samg4_get_filnam_
#define SAMG4_ISET_FILNAM_DUMPSOL samg4_iset_filnam_dumpsol_
#define SAMG4_IGET_FILNAM_DUMPSOL samg4_iget_filnam_dumpsol_
#define SAMG4_SET_FILNAM_DUMPSOL samg4_set_filnam_dumpsol_
#define SAMG4_GET_FILNAM_DUMPSOL samg4_get_filnam_dumpsol_
#define SAMG4_ISET_FILNAM_DUMP samg4_iset_filnam_dump_
#define SAMG4_IGET_FILNAM_DUMP samg4_iget_filnam_dump_
#define SAMG4_SET_FILNAM_DUMP samg4_set_filnam_dump_
#define SAMG4_GET_FILNAM_DUMP samg4_get_filnam_dump_
#define SAMG4_ISET_FILNAM_UZAWA samg4_iset_filnam_uzawa_
#define SAMG4_IGET_FILNAM_UZAWA samg4_iget_filnam_uzawa_
#define SAMG4_SET_FILNAM_UZAWA samg4_set_filnam_uzawa_
#define SAMG4_GET_FILNAM_UZAWA samg4_get_filnam_uzawa_
#define SAMG4_SET_FLEX_PCG_LITE samg4_set_flex_pcg_lite_
#define SAMG4_GET_FLEX_PCG_LITE samg4_get_flex_pcg_lite_
#define SAMG4_SET_FORCE_ACCEL samg4_set_force_accel_
#define SAMG4_GET_FORCE_ACCEL samg4_get_force_accel_
#define SAMG4_SET_FORCE_ACCEL_2ND samg4_set_force_accel_2nd_
#define SAMG4_GET_FORCE_ACCEL_2ND samg4_get_force_accel_2nd_
#define SAMG4_SET_FULL_PIVOTING samg4_set_full_pivoting_
#define SAMG4_GET_FULL_PIVOTING samg4_get_full_pivoting_
#define SAMG4_SET_FULL_SETUP samg4_set_full_setup_
#define SAMG4_GET_FULL_SETUP samg4_get_full_setup_
#define SAMG4_SET_G_CMPLX_AGG_DEFAULT samg4_set_g_cmplx_agg_default_
#define SAMG4_GET_G_CMPLX_AGG_DEFAULT samg4_get_g_cmplx_agg_default_
#define SAMG4_SET_G_CMPLX_DEFAULT samg4_set_g_cmplx_default_
#define SAMG4_GET_G_CMPLX_DEFAULT samg4_get_g_cmplx_default_
#define SAMG4_SET_GALERKIN_TIMER samg4_set_galerkin_timer_
#define SAMG4_GET_GALERKIN_TIMER samg4_get_galerkin_timer_
#define SAMG4_SET_GLK_MULT_ZEROS samg4_set_glk_mult_zeros_
#define SAMG4_GET_GLK_MULT_ZEROS samg4_get_glk_mult_zeros_
#define SAMG4_SET_GMAX_MULTIPASS samg4_set_gmax_multipass_
#define SAMG4_GET_GMAX_MULTIPASS samg4_get_gmax_multipass_
#define SAMG4_SET_IAGGREGATION_PROFILE samg4_set_iaggregation_profile_
#define SAMG4_GET_IAGGREGATION_PROFILE samg4_get_iaggregation_profile_
#define SAMG4_SET_IAGGREGATION samg4_set_iaggregation_
#define SAMG4_GET_IAGGREGATION samg4_get_iaggregation_
#define SAMG4_SET_IALL_SMO samg4_set_iall_smo_
#define SAMG4_GET_IALL_SMO samg4_get_iall_smo_
#define SAMG4_SET_IAUTO_OMEGA_JACOBI samg4_set_iauto_omega_jacobi_
#define SAMG4_GET_IAUTO_OMEGA_JACOBI samg4_get_iauto_omega_jacobi_
#define SAMG4_SET_IAUTO_OMEGA_SMOAGG samg4_set_iauto_omega_smoagg_
#define SAMG4_GET_IAUTO_OMEGA_SMOAGG samg4_get_iauto_omega_smoagg_
#define SAMG4_SET_IAUTO_STOP samg4_set_iauto_stop_
#define SAMG4_GET_IAUTO_STOP samg4_get_iauto_stop_
#define SAMG4_SET_IDUMP_SEQUENCE_START samg4_set_idump_sequence_start_
#define SAMG4_GET_IDUMP_SEQUENCE_START samg4_get_idump_sequence_start_
#define SAMG4_SET_IDUMP_SEQUENCE_END samg4_set_idump_sequence_end_
#define SAMG4_GET_IDUMP_SEQUENCE_END samg4_get_idump_sequence_end_
#define SAMG4_SET_ISTAB_CG samg4_set_istab_cg_
#define SAMG4_GET_ISTAB_CG samg4_get_istab_cg_
#define SAMG4_SET_IELASTICITY_PROFILE samg4_set_ielasticity_profile_
#define SAMG4_GET_IELASTICITY_PROFILE samg4_get_ielasticity_profile_
#define SAMG4_SET_IELASTICITY samg4_set_ielasticity_
#define SAMG4_GET_IELASTICITY samg4_get_ielasticity_
#define SAMG4_SET_IESTIM_SPECT_RADIUS samg4_set_iestim_spect_radius_
#define SAMG4_GET_IESTIM_SPECT_RADIUS samg4_get_iestim_spect_radius_
#define SAMG4_SET_IESTIM_SMOOTH_NIT samg4_set_iestim_smooth_nit_
#define SAMG4_GET_IESTIM_SMOOTH_NIT samg4_get_iestim_smooth_nit_
#define SAMG4_SET_INIT_RES_TREATMENT samg4_set_init_res_treatment_
#define SAMG4_GET_INIT_RES_TREATMENT samg4_get_init_res_treatment_
#define SAMG4_SET_IPRNT_RES_ACCURACY samg4_set_iprnt_res_accuracy_
#define SAMG4_GET_IPRNT_RES_ACCURACY samg4_get_iprnt_res_accuracy_
#define SAMG4_SET_ISMO2DFL samg4_set_ismo2dfl_
#define SAMG4_GET_ISMO2DFL samg4_get_ismo2dfl_
#define SAMG4_SET_ISMOAGG_AGGRESSIVE samg4_set_ismoagg_aggressive_
#define SAMG4_GET_ISMOAGG_AGGRESSIVE samg4_get_ismoagg_aggressive_
#define SAMG4_SET_ISMOAGG_OVERCORRECTION samg4_set_ismoagg_overcorrection_
#define SAMG4_GET_ISMOAGG_OVERCORRECTION samg4_get_ismoagg_overcorrection_
#define SAMG4_SET_ISMOAGG_OPTIM samg4_set_ismoagg_optim_
#define SAMG4_GET_ISMOAGG_OPTIM samg4_get_ismoagg_optim_
#define SAMG4_SET_ISMOAGG_BLOCK_TYP samg4_set_ismoagg_block_typ_
#define SAMG4_GET_ISMOAGG_BLOCK_TYP samg4_get_ismoagg_block_typ_
#define SAMG4_SET_ISMOAGG_COMPRESSION samg4_set_ismoagg_compression_
#define SAMG4_GET_ISMOAGG_COMPRESSION samg4_get_ismoagg_compression_
#define SAMG4_SET_ISMOAGG_FILTER_TYP samg4_set_ismoagg_filter_typ_
#define SAMG4_GET_ISMOAGG_FILTER_TYP samg4_get_ismoagg_filter_typ_
#define SAMG4_SET_ISMOAGG_SMOOTH_TYP samg4_set_ismoagg_smooth_typ_
#define SAMG4_GET_ISMOAGG_SMOOTH_TYP samg4_get_ismoagg_smooth_typ_
#define SAMG4_SET_ISMOAGG_SMOOTH_NIT samg4_set_ismoagg_smooth_nit_
#define SAMG4_GET_ISMOAGG_SMOOTH_NIT samg4_get_ismoagg_smooth_nit_
#define SAMG4_SET_ISMOAGG_SMOOTH_1LEV samg4_set_ismoagg_smooth_1lev_
#define SAMG4_GET_ISMOAGG_SMOOTH_1LEV samg4_get_ismoagg_smooth_1lev_
#define SAMG4_SET_ISMOAGG_SMOOTH_NLEV samg4_set_ismoagg_smooth_nlev_
#define SAMG4_GET_ISMOAGG_SMOOTH_NLEV samg4_get_ismoagg_smooth_nlev_
#define SAMG4_SET_IB_CMPLX samg4_set_ib_cmplx_
#define SAMG4_GET_IB_CMPLX samg4_get_ib_cmplx_
#define SAMG4_SET_IB_CMPLX_AGG_DEFAULT samg4_set_ib_cmplx_agg_default_
#define SAMG4_GET_IB_CMPLX_AGG_DEFAULT samg4_get_ib_cmplx_agg_default_
#define SAMG4_SET_IB_CMPLX_DEFAULT samg4_set_ib_cmplx_default_
#define SAMG4_GET_IB_CMPLX_DEFAULT samg4_get_ib_cmplx_default_
#define SAMG4_SET_IBGS_PIVOT samg4_set_ibgs_pivot_
#define SAMG4_GET_IBGS_PIVOT samg4_get_ibgs_pivot_
#define SAMG4_SET_ICASE_JAC_UZAWA samg4_set_icase_jac_uzawa_
#define SAMG4_GET_ICASE_JAC_UZAWA samg4_get_icase_jac_uzawa_
#define SAMG4_SET_ISTATISTICS_SMOVEC samg4_set_istatistics_smovec_
#define SAMG4_GET_ISTATISTICS_SMOVEC samg4_get_istatistics_smovec_
#define SAMG4_SET_ICHECK_SMOINT samg4_set_icheck_smoint_
#define SAMG4_GET_ICHECK_SMOINT samg4_get_icheck_smoint_
#define SAMG4_SET_ICOLOR_OMP samg4_set_icolor_omp_
#define SAMG4_GET_ICOLOR_OMP samg4_get_icolor_omp_
#define SAMG4_SET_IORDERED_OMP samg4_set_iordered_omp_
#define SAMG4_GET_IORDERED_OMP samg4_get_iordered_omp_
#define SAMG4_SET_ICRITS samg4_set_icrits_
#define SAMG4_GET_ICRITS samg4_get_icrits_
#define SAMG4_SET_IDTEST_UZAWA samg4_set_idtest_uzawa_
#define SAMG4_GET_IDTEST_UZAWA samg4_get_idtest_uzawa_
#define SAMG4_SET_IHUGE samg4_set_ihuge_
#define SAMG4_GET_IHUGE samg4_get_ihuge_
#define SAMG4_SET_IJAC_UZAWA samg4_set_ijac_uzawa_
#define SAMG4_GET_IJAC_UZAWA samg4_get_ijac_uzawa_
#define SAMG4_SET_ILU4ALLSCHWARZ samg4_set_ilu4allschwarz_
#define SAMG4_GET_ILU4ALLSCHWARZ samg4_get_ilu4allschwarz_
#define SAMG4_SET_ILU_SPEED samg4_set_ilu_speed_
#define SAMG4_GET_ILU_SPEED samg4_get_ilu_speed_
#define SAMG4_SET_IMPLDO_READ_WRITE_LEN samg4_set_impldo_read_write_len_
#define SAMG4_GET_IMPLDO_READ_WRITE_LEN samg4_get_impldo_read_write_len_
#define SAMG4_SET_INFO_KEEPMEM samg4_set_info_keepmem_
#define SAMG4_GET_INFO_KEEPMEM samg4_get_info_keepmem_
#define SAMG4_SET_INNER_ACCEL samg4_set_inner_accel_
#define SAMG4_GET_INNER_ACCEL samg4_get_inner_accel_
#define SAMG4_SET_IODUMP samg4_set_iodump_
#define SAMG4_GET_IODUMP samg4_get_iodump_
#define SAMG4_ISET_IOFILE_OPTA samg4_iset_iofile_opta_
#define SAMG4_IGET_IOFILE_OPTA samg4_iget_iofile_opta_
#define SAMG4_SET_IOFILE_OPTA samg4_set_iofile_opta_
#define SAMG4_GET_IOFILE_OPTA samg4_get_iofile_opta_
#define SAMG4_ISET_IOFORM samg4_iset_ioform_
#define SAMG4_IGET_IOFORM samg4_iget_ioform_
#define SAMG4_SET_IOFORM samg4_set_ioform_
#define SAMG4_GET_IOFORM samg4_get_ioform_
#define SAMG4_SET_IOGRID samg4_set_iogrid_
#define SAMG4_GET_IOGRID samg4_get_iogrid_
#define SAMG4_SET_IOMOVIE samg4_set_iomovie_
#define SAMG4_GET_IOMOVIE samg4_get_iomovie_
#define SAMG4_SET_IOSCRATCH_DEFAULT samg4_set_ioscratch_default_
#define SAMG4_GET_IOSCRATCH_DEFAULT samg4_get_ioscratch_default_
#define SAMG4_SET_IOUNIT_OPTA samg4_set_iounit_opta_
