openCSMP/openCSMP/lib/samg/samg4.h
#define SAMG4_GET_IOUNIT_OPTA samg4_get_iounit_opta_
#define SAMG4_SET_IPASS_MAX_SET samg4_set_ipass_max_set_
#define SAMG4_GET_IPASS_MAX_SET samg4_get_ipass_max_set_
#define SAMG4_SET_IRESTRICTION_OPENMP samg4_set_irestriction_openmp_
#define SAMG4_GET_IRESTRICTION_OPENMP samg4_get_irestriction_openmp_
#define SAMG4_SET_IPRESSURE_UZAWA samg4_set_ipressure_uzawa_
#define SAMG4_GET_IPRESSURE_UZAWA samg4_get_ipressure_uzawa_
#define SAMG4_SET_IPROFILE_GEOMETRIC samg4_set_iprofile_geometric_
#define SAMG4_GET_IPROFILE_GEOMETRIC samg4_get_iprofile_geometric_
#define SAMG4_SET_ISAT_UZAWA samg4_set_isat_uzawa_
#define SAMG4_GET_ISAT_UZAWA samg4_get_isat_uzawa_
#define SAMG4_SET_ISET_VIO_DD samg4_set_iset_vio_dd_
#define SAMG4_GET_ISET_VIO_DD samg4_get_iset_vio_dd_
#define SAMG4_SET_ISSTEP_UZAWA samg4_set_isstep_uzawa_
#define SAMG4_GET_ISSTEP_UZAWA samg4_get_isstep_uzawa_
#define SAMG4_SET_ISTEP1CASE_UZAWA samg4_set_istep1case_uzawa_
#define SAMG4_GET_ISTEP1CASE_UZAWA samg4_get_istep1case_uzawa_
#define SAMG4_SET_ISTEERING samg4_set_isteering_
#define SAMG4_GET_ISTEERING samg4_get_isteering_
#define SAMG4_SET_ISWIT3_USER samg4_set_iswit3_user_
#define SAMG4_GET_ISWIT3_USER samg4_get_iswit3_user_
#define SAMG4_SET_ITER_CHECK samg4_set_iter_check_
#define SAMG4_GET_ITER_CHECK samg4_get_iter_check_
#define SAMG4_SET_ITER_MATRIX_SCALE samg4_set_iter_matrix_scale_
#define SAMG4_GET_ITER_MATRIX_SCALE samg4_get_iter_matrix_scale_
#define SAMG4_SET_ITER_PRE samg4_set_iter_pre_
#define SAMG4_GET_ITER_PRE samg4_get_iter_pre_
#define SAMG4_SET_ITMAX_CONV samg4_set_itmax_conv_
#define SAMG4_GET_ITMAX_CONV samg4_get_itmax_conv_
#define SAMG4_SET_ITRACE_AMGMAIN samg4_set_itrace_amgmain_
#define SAMG4_GET_ITRACE_AMGMAIN samg4_get_itrace_amgmain_
#define SAMG4_SET_ITRACELEVEL samg4_set_itracelevel_
#define SAMG4_GET_ITRACELEVEL samg4_get_itracelevel_
#define SAMG4_SET_ITRACE_CLSOL samg4_set_itrace_clsol_
#define SAMG4_GET_ITRACE_CLSOL samg4_get_itrace_clsol_
#define SAMG4_SET_ITRACE_CLDENSE samg4_set_itrace_cldense_
#define SAMG4_GET_ITRACE_CLDENSE samg4_get_itrace_cldense_
#define SAMG4_SET_ITRACE_DIVSTOP samg4_set_itrace_divstop_
#define SAMG4_GET_ITRACE_DIVSTOP samg4_get_itrace_divstop_
#define SAMG4_SET_ITRACE_JAC_UZAWA samg4_set_itrace_jac_uzawa_
#define SAMG4_GET_ITRACE_JAC_UZAWA samg4_get_itrace_jac_uzawa_
#define SAMG4_SET_ITRACE_MK_REGULAR samg4_set_itrace_mk_regular_
#define SAMG4_GET_ITRACE_MK_REGULAR samg4_get_itrace_mk_regular_
#define SAMG4_SET_ITRACE_MATRIX_MODE samg4_set_itrace_matrix_mode_
#define SAMG4_GET_ITRACE_MATRIX_MODE samg4_get_itrace_matrix_mode_
#define SAMG4_SET_ITRACE_MATRIX_STORAGE samg4_set_itrace_matrix_storage_
#define SAMG4_GET_ITRACE_MATRIX_STORAGE samg4_get_itrace_matrix_storage_
#define SAMG4_SET_ITRACE_SCHWARZ samg4_set_itrace_schwarz_
#define SAMG4_GET_ITRACE_SCHWARZ samg4_get_itrace_schwarz_
#define SAMG4_SET_ITRACE_SMO samg4_set_itrace_smo_
#define SAMG4_GET_ITRACE_SMO samg4_get_itrace_smo_
#define SAMG4_SET_ITRACE_SOL samg4_set_itrace_sol_
#define SAMG4_GET_ITRACE_SOL samg4_get_itrace_sol_
#define SAMG4_SET_ITRACE_SPLIT samg4_set_itrace_split_
#define SAMG4_GET_ITRACE_SPLIT samg4_get_itrace_split_
#define SAMG4_SET_ITRACE_UZAWA samg4_set_itrace_uzawa_
#define SAMG4_GET_ITRACE_UZAWA samg4_get_itrace_uzawa_
#define SAMG4_SET_SMOAGG_NOQR samg4_set_smoagg_noqr_
#define SAMG4_GET_SMOAGG_NOQR samg4_get_smoagg_noqr_
#define SAMG4_SET_STACKTRACE samg4_set_stacktrace_
#define SAMG4_GET_STACKTRACE samg4_get_stacktrace_
#define SAMG4_SET_STORE_PGS_FACTOR samg4_set_store_pgs_factor_
#define SAMG4_GET_STORE_PGS_FACTOR samg4_get_store_pgs_factor_
#define SAMG4_SET_KCYCLE_PROFILE samg4_set_kcycle_profile_
#define SAMG4_GET_KCYCLE_PROFILE samg4_get_kcycle_profile_
#define SAMG4_SET_KEEPMEM samg4_set_keepmem_
#define SAMG4_GET_KEEPMEM samg4_get_keepmem_
#define SAMG4_SET_K_DISABLE_KRYLOV1 samg4_set_k_disable_krylov1_
#define SAMG4_GET_K_DISABLE_KRYLOV1 samg4_get_k_disable_krylov1_
#define SAMG4_SET_K_DYNCYC samg4_set_k_dyncyc_
#define SAMG4_GET_K_DYNCYC samg4_get_k_dyncyc_
#define SAMG4_SET_LASTGRID samg4_set_lastgrid_
#define SAMG4_GET_LASTGRID samg4_get_lastgrid_
#define SAMG4_SET_LEV_COARSENING_TOO_SLOW samg4_set_lev_coarsening_too_slow_
#define SAMG4_GET_LEV_COARSENING_TOO_SLOW samg4_get_lev_coarsening_too_slow_
#define SAMG4_SET_LEVELS_UZAWA samg4_set_levels_uzawa_
#define SAMG4_GET_LEVELS_UZAWA samg4_get_levels_uzawa_
#define SAMG4_SET_LEVELX samg4_set_levelx_
#define SAMG4_GET_LEVELX samg4_get_levelx_
#define SAMG4_SET_LEVELX_2ND samg4_set_levelx_2nd_
#define SAMG4_GET_LEVELX_2ND samg4_get_levelx_2nd_
#define SAMG4_SET_LFIL_CL samg4_set_lfil_cl_
#define SAMG4_GET_LFIL_CL samg4_get_lfil_cl_
#define SAMG4_SET_LFIL_2ND samg4_set_lfil_2nd_
#define SAMG4_GET_LFIL_2ND samg4_get_lfil_2nd_
#define SAMG4_SET_LFIL_SMO samg4_set_lfil_smo_
#define SAMG4_GET_LFIL_SMO samg4_get_lfil_smo_
#define SAMG4_ISET_LOGFILE samg4_iset_logfile_
#define SAMG4_IGET_LOGFILE samg4_iget_logfile_
#define SAMG4_SET_LOGFILE samg4_set_logfile_
#define SAMG4_GET_LOGFILE samg4_get_logfile_
#define SAMG4_SET_LOGIO samg4_set_logio_
#define SAMG4_GET_LOGIO samg4_get_logio_
#define SAMG4_SET_LU_REUSE samg4_set_lu_reuse_
#define SAMG4_GET_LU_REUSE samg4_get_lu_reuse_
#define SAMG4_SET_MATRIX_MODE samg4_set_matrix_mode_
#define SAMG4_GET_MATRIX_MODE samg4_get_matrix_mode_
#define SAMG4_SET_MATRIX_FORMAT samg4_set_matrix_format_
#define SAMG4_GET_MATRIX_FORMAT samg4_get_matrix_format_
#define SAMG4_SET_MATRIX_SCALE_RENORM samg4_set_matrix_scale_renorm_
#define SAMG4_GET_MATRIX_SCALE_RENORM samg4_get_matrix_scale_renorm_
#define SAMG4_SET_MAX_CALLS samg4_set_max_calls_
#define SAMG4_GET_MAX_CALLS samg4_get_max_calls_
#define SAMG4_SET_MAX_CL_SIZE samg4_set_max_cl_size_
#define SAMG4_GET_MAX_CL_SIZE samg4_get_max_cl_size_
#define SAMG4_SET_MAXCORR_CLUSTER samg4_set_maxcorr_cluster_
#define SAMG4_GET_MAXCORR_CLUSTER samg4_get_maxcorr_cluster_
#define SAMG4_SET_MAX_LEVEL samg4_set_max_level_
#define SAMG4_GET_MAX_LEVEL samg4_get_max_level_
#define SAMG4_SET_MAX_NB_LIST_SIZE samg4_set_max_nb_list_size_
#define SAMG4_GET_MAX_NB_LIST_SIZE samg4_get_max_nb_list_size_
#define SAMG4_SET_MAXITER_JAC_UZAWA samg4_set_maxiter_jac_uzawa_
#define SAMG4_GET_MAXITER_JAC_UZAWA samg4_get_maxiter_jac_uzawa_
#define SAMG4_SET_MAXOP_RESTART samg4_set_maxop_restart_
#define SAMG4_GET_MAXOP_RESTART samg4_get_maxop_restart_
#define SAMG4_SET_MAXRETRY_JAC_UZAWA samg4_set_maxretry_jac_uzawa_
#define SAMG4_GET_MAXRETRY_JAC_UZAWA samg4_get_maxretry_jac_uzawa_
#define SAMG4_SET_MILU samg4_set_milu_
#define SAMG4_GET_MILU samg4_get_milu_
#define SAMG4_SET_MIN_CL_SIZE samg4_set_min_cl_size_
#define SAMG4_GET_MIN_CL_SIZE samg4_get_min_cl_size_
#define SAMG4_SET_MIN_MULTI_SIZE samg4_set_min_multi_size_
#define SAMG4_GET_MIN_MULTI_SIZE samg4_get_min_multi_size_
#define SAMG4_SET_MINITER_JAC_UZAWA samg4_set_miniter_jac_uzawa_
#define SAMG4_GET_MINITER_JAC_UZAWA samg4_get_miniter_jac_uzawa_
#define SAMG4_SET_MK_REGULAR samg4_set_mk_regular_
#define SAMG4_GET_MK_REGULAR samg4_get_mk_regular_
#define SAMG4_SET_MODE_CNTRL samg4_set_mode_cntrl_
#define SAMG4_GET_MODE_CNTRL samg4_get_mode_cntrl_
#define SAMG4_SET_MODE_DEBUG samg4_set_mode_debug_
#define SAMG4_GET_MODE_DEBUG samg4_get_mode_debug_
#define SAMG4_SET_MODE_MESS samg4_set_mode_mess_
#define SAMG4_GET_MODE_MESS samg4_get_mode_mess_
#define SAMG4_SET_MODIFY_MAT samg4_set_modify_mat_
#define SAMG4_GET_MODIFY_MAT samg4_get_modify_mat_
#define SAMG4_SET_MODIFY_RESTRICTION samg4_set_modify_restriction_
#define SAMG4_GET_MODIFY_RESTRICTION samg4_get_modify_restriction_
#define SAMG4_SET_MULTIPASS_ALLCOUP samg4_set_multipass_allcoup_
#define SAMG4_GET_MULTIPASS_ALLCOUP samg4_get_multipass_allcoup_
#define SAMG4_SET_NBLK_DEBUG samg4_set_nblk_debug_
#define SAMG4_GET_NBLK_DEBUG samg4_get_nblk_debug_
#define SAMG4_SET_NBLK_MAX samg4_set_nblk_max_
#define SAMG4_GET_NBLK_MAX samg4_get_nblk_max_
#define SAMG4_SET_NBLK_OVERLAP samg4_set_nblk_overlap_
#define SAMG4_GET_NBLK_OVERLAP samg4_get_nblk_overlap_
#define SAMG4_SET_NBLK_RESID samg4_set_nblk_resid_
#define SAMG4_GET_NBLK_RESID samg4_get_nblk_resid_
#define SAMG4_SET_NBLK_SOLVE samg4_set_nblk_solve_
#define SAMG4_GET_NBLK_SOLVE samg4_get_nblk_solve_
#define SAMG4_SET_NBLK_SOLVER samg4_set_nblk_solver_
#define SAMG4_GET_NBLK_SOLVER samg4_get_nblk_solver_
#define SAMG4_SET_NBND_OMEGA samg4_set_nbnd_omega_
#define SAMG4_GET_NBND_OMEGA samg4_get_nbnd_omega_
#define SAMG4_SET_NBND_OMEGA_UZAWA samg4_set_nbnd_omega_uzawa_
#define SAMG4_GET_NBND_OMEGA_UZAWA samg4_get_nbnd_omega_uzawa_
#define SAMG4_SET_NBND_SWEEPS samg4_set_nbnd_sweeps_
#define SAMG4_GET_NBND_SWEEPS samg4_get_nbnd_sweeps_
#define SAMG4_SET_NBND_SWEEPS_UZAWA samg4_set_nbnd_sweeps_uzawa_
#define SAMG4_GET_NBND_SWEEPS_UZAWA samg4_get_nbnd_sweeps_uzawa_
#define SAMG4_SET_NCOLOR_BLOCK_GS samg4_set_ncolor_block_gs_
#define SAMG4_GET_NCOLOR_BLOCK_GS samg4_get_ncolor_block_gs_
#define SAMG4_SET_NCOLOR_BLOCK_GS_MSG samg4_set_ncolor_block_gs_msg_
#define SAMG4_GET_NCOLOR_BLOCK_GS_MSG samg4_get_ncolor_block_gs_msg_
#define SAMG4_SET_NCOLOR_BLOCK_GS_RESCHK samg4_set_ncolor_block_gs_reschk_
#define SAMG4_GET_NCOLOR_BLOCK_GS_RESCHK samg4_get_ncolor_block_gs_reschk_
#define SAMG4_SET_NDEGREE_CHEBY samg4_set_ndegree_cheby_
#define SAMG4_GET_NDEGREE_CHEBY samg4_get_ndegree_cheby_
#define SAMG4_SET_NCFRAMES samg4_set_ncframes_
#define SAMG4_GET_NCFRAMES samg4_get_ncframes_
#define SAMG4_SET_NCG samg4_set_ncg_
#define SAMG4_GET_NCG samg4_get_ncg_
#define SAMG4_SET_NCGRAD_DEFAULT samg4_set_ncgrad_default_
#define SAMG4_GET_NCGRAD_DEFAULT samg4_get_ncgrad_default_
#define SAMG4_SET_NCYC_DEFAULT samg4_set_ncyc_default_
#define SAMG4_GET_NCYC_DEFAULT samg4_get_ncyc_default_
#define SAMG4_SET_NCYC_MIN samg4_set_ncyc_min_
#define SAMG4_GET_NCYC_MIN samg4_get_ncyc_min_
#define SAMG4_SET_NCYC_2ND samg4_set_ncyc_2nd_
#define SAMG4_GET_NCYC_2ND samg4_get_ncyc_2nd_
#define SAMG4_SET_NCYC_START samg4_set_ncyc_start_
#define SAMG4_GET_NCYC_START samg4_get_ncyc_start_
#define SAMG4_SET_NDYN_SMO samg4_set_ndyn_smo_
#define SAMG4_GET_NDYN_SMO samg4_get_ndyn_smo_
#define SAMG4_SET_NEG_DIAG samg4_set_neg_diag_
#define SAMG4_GET_NEG_DIAG samg4_get_neg_diag_
#define SAMG4_SET_NEG_DIAG_BRUTE samg4_set_neg_diag_brute_
#define SAMG4_GET_NEG_DIAG_BRUTE samg4_get_neg_diag_brute_
#define SAMG4_SET_NEW_ENTRIES samg4_set_new_entries_
#define SAMG4_GET_NEW_ENTRIES samg4_get_new_entries_
#define SAMG4_SET_NEW_TOPOLOGY samg4_set_new_topology_
#define SAMG4_GET_NEW_TOPOLOGY samg4_get_new_topology_
#define SAMG4_SET_NILU_REORDER samg4_set_nilu_reorder_
#define SAMG4_GET_NILU_REORDER samg4_get_nilu_reorder_
#define SAMG4_SET_NINCR_RES_ACCEPTED_MG samg4_set_nincr_res_accepted_mg_
#define SAMG4_GET_NINCR_RES_ACCEPTED_MG samg4_get_nincr_res_accepted_mg_
#define SAMG4_SET_NINCR_RES_ACCEPTED_1G samg4_set_nincr_res_accepted_1g_
#define SAMG4_GET_NINCR_RES_ACCEPTED_1G samg4_get_nincr_res_accepted_1g_
#define SAMG4_SET_NINT_ROWSUM1 samg4_set_nint_rowsum1_
#define SAMG4_GET_NINT_ROWSUM1 samg4_get_nint_rowsum1_
#define SAMG4_SET_NINTER_OMP samg4_set_ninter_omp_
#define SAMG4_GET_NINTER_OMP samg4_get_ninter_omp_
#define SAMG4_SET_NITER_SKIP samg4_set_niter_skip_
#define SAMG4_GET_NITER_SKIP samg4_get_niter_skip_
#define SAMG4_SET_NKCYCLE samg4_set_nkcycle_
#define SAMG4_GET_NKCYCLE samg4_get_nkcycle_
#define SAMG4_SET_NKDIM_DEFAULT samg4_set_nkdim_default_
#define SAMG4_GET_NKDIM_DEFAULT samg4_get_nkdim_default_
#define SAMG4_SET_NSMOOTH_COO_POLY samg4_set_nsmooth_coo_poly_
#define SAMG4_GET_NSMOOTH_COO_POLY samg4_get_nsmooth_coo_poly_
#define SAMG4_SET_NSMOAGG samg4_set_nsmoagg_
#define SAMG4_GET_NSMOAGG samg4_get_nsmoagg_
#define SAMG4_SET_NSMOAGG1LEV samg4_set_nsmoagg1lev_
#define SAMG4_GET_NSMOAGG1LEV samg4_get_nsmoagg1lev_
#define SAMG4_SET_NSMOAGGLEV samg4_set_nsmoagglev_
#define SAMG4_GET_NSMOAGGLEV samg4_get_nsmoagglev_
#define SAMG4_SET_NMIN_MATRIX samg4_set_nmin_matrix_
#define SAMG4_GET_NMIN_MATRIX samg4_get_nmin_matrix_
#define SAMG4_SET_NMIN_MATRIX_RESC samg4_set_nmin_matrix_resc_
#define SAMG4_GET_NMIN_MATRIX_RESC samg4_get_nmin_matrix_resc_
#define SAMG4_SET_NMIN_VECTOR samg4_set_nmin_vector_
#define SAMG4_GET_NMIN_VECTOR samg4_get_nmin_vector_
#define SAMG4_SET_NOTALLUNS_CHEAP samg4_set_notalluns_cheap_
#define SAMG4_GET_NOTALLUNS_CHEAP samg4_get_notalluns_cheap_
#define SAMG4_SET_NP_MOD1 samg4_set_np_mod1_
#define SAMG4_GET_NP_MOD1 samg4_get_np_mod1_
#define SAMG4_SET_NP_MOD2 samg4_set_np_mod2_
#define SAMG4_GET_NP_MOD2 samg4_get_np_mod2_
#define SAMG4_SET_NP_OPT samg4_set_np_opt_
#define SAMG4_GET_NP_OPT samg4_get_np_opt_
#define SAMG4_SET_NPRIM_AT_ALLPNTS samg4_set_nprim_at_allpnts_
#define SAMG4_GET_NPRIM_AT_ALLPNTS samg4_get_nprim_at_allpnts_
#define SAMG4_SET_NPTMAX samg4_set_nptmax_
#define SAMG4_GET_NPTMAX samg4_get_nptmax_
#define SAMG4_SET_NPTMN samg4_set_nptmn_
#define SAMG4_GET_NPTMN samg4_get_nptmn_
#define SAMG4_SET_NRC samg4_set_nrc_
#define SAMG4_GET_NRC samg4_get_nrc_
#define SAMG4_SET_NRC_EMERGENCY samg4_set_nrc_emergency_
#define SAMG4_GET_NRC_EMERGENCY samg4_get_nrc_emergency_
#define SAMG4_SET_NRD samg4_set_nrd_
#define SAMG4_GET_NRD samg4_get_nrd_
#define SAMG4_SET_NRD_2ND samg4_set_nrd_2nd_
#define SAMG4_GET_NRD_2ND samg4_get_nrd_2nd_
#define SAMG4_SET_NRU samg4_set_nru_
#define SAMG4_GET_NRU samg4_get_nru_
#define SAMG4_SET_NRU_2ND samg4_set_nru_2nd_
#define SAMG4_GET_NRU_2ND samg4_get_nru_2nd_
#define SAMG4_SET_NSIMPLE_EMERGENCY samg4_set_nsimple_emergency_
#define SAMG4_GET_NSIMPLE_EMERGENCY samg4_get_nsimple_emergency_
#define SAMG4_SET_NSOLVE_DEFAULT samg4_set_nsolve_default_
#define SAMG4_GET_NSOLVE_DEFAULT samg4_get_nsolve_default_
#define SAMG4_SET_NSOLVE_2ND samg4_set_nsolve_2nd_
#define SAMG4_GET_NSOLVE_2ND samg4_get_nsolve_2nd_
#define SAMG4_SET_NSOLVE_UZAWA samg4_set_nsolve_uzawa_
#define SAMG4_GET_NSOLVE_UZAWA samg4_get_nsolve_uzawa_
#define SAMG4_SET_NSTAR_TYP samg4_set_nstar_typ_
#define SAMG4_GET_NSTAR_TYP samg4_get_nstar_typ_
#define SAMG4_SET_NSW_OMEGA_UZAWA samg4_set_nsw_omega_uzawa_
#define SAMG4_GET_NSW_OMEGA_UZAWA samg4_get_nsw_omega_uzawa_
#define SAMG4_SET_NSW_UZAWA samg4_set_nsw_uzawa_
#define SAMG4_GET_NSW_UZAWA samg4_get_nsw_uzawa_
#define SAMG4_SET_NTAKE_RES_IN samg4_set_ntake_res_in_
#define SAMG4_GET_NTAKE_RES_IN samg4_get_ntake_res_in_
#define SAMG4_SET_NTH_RES_SCRATCH samg4_set_nth_res_scratch_
#define SAMG4_GET_NTH_RES_SCRATCH samg4_get_nth_res_scratch_
#define SAMG4_SET_NTR samg4_set_ntr_
#define SAMG4_GET_NTR samg4_get_ntr_
#define SAMG4_SET_NTR_PRIM samg4_set_ntr_prim_
#define SAMG4_GET_NTR_PRIM samg4_get_ntr_prim_
#define SAMG4_SET_NTYP_ACCEL samg4_set_ntyp_accel_
#define SAMG4_GET_NTYP_ACCEL samg4_get_ntyp_accel_
#define SAMG4_SET_NTYP_GALERKIN samg4_set_ntyp_galerkin_
#define SAMG4_GET_NTYP_GALERKIN samg4_get_ntyp_galerkin_
#define SAMG4_SET_NUMTRY_MAX_SET samg4_set_numtry_max_set_
#define SAMG4_GET_NUMTRY_MAX_SET samg4_get_numtry_max_set_
#define SAMG4_SET_NVERSION samg4_set_nversion_
#define SAMG4_GET_NVERSION samg4_get_nversion_
#define SAMG4_SET_NWT samg4_set_nwt_
#define SAMG4_GET_NWT samg4_get_nwt_
#define SAMG4_SET_NXTYP_COARSE samg4_set_nxtyp_coarse_
#define SAMG4_GET_NXTYP_COARSE samg4_get_nxtyp_coarse_
#define SAMG4_SET_OIL_ACCEL samg4_set_oil_accel_
#define SAMG4_GET_OIL_ACCEL samg4_get_oil_accel_
#define SAMG4_SET_OIL_GPRS samg4_set_oil_gprs_
#define SAMG4_GET_OIL_GPRS samg4_get_oil_gprs_
#define SAMG4_SET_OIL_NOPRIM samg4_set_oil_noprim_
#define SAMG4_GET_OIL_NOPRIM samg4_get_oil_noprim_
#define SAMG4_SET_OMEGA_JAC_ES_UZAWA samg4_set_omega_jac_es_uzawa_
#define SAMG4_GET_OMEGA_JAC_ES_UZAWA samg4_get_omega_jac_es_uzawa_
#define SAMG4_SET_OMEGA_JAC_P_UZAWA samg4_set_omega_jac_p_uzawa_
#define SAMG4_GET_OMEGA_JAC_P_UZAWA samg4_get_omega_jac_p_uzawa_
#define SAMG4_SET_OMEGA_JACOBI samg4_set_omega_jacobi_
#define SAMG4_GET_OMEGA_JACOBI samg4_get_omega_jacobi_
#define SAMG4_SET_OMEGA_SOR_DO samg4_set_omega_sor_do_
#define SAMG4_GET_OMEGA_SOR_DO samg4_get_omega_sor_do_
#define SAMG4_SET_OMEGA_SOR_UP samg4_set_omega_sor_up_
#define SAMG4_GET_OMEGA_SOR_UP samg4_get_omega_sor_up_
#define SAMG4_SET_OMEGA_SMO samg4_set_omega_smo_
#define SAMG4_GET_OMEGA_SMO samg4_get_omega_smo_
#define SAMG4_SET_OMEGA_SMO_MIN samg4_set_omega_smo_min_
#define SAMG4_GET_OMEGA_SMO_MIN samg4_get_omega_smo_min_
#define SAMG4_SET_OMEGA_UZAWA samg4_set_omega_uzawa_
#define SAMG4_GET_OMEGA_UZAWA samg4_get_omega_uzawa_
#define SAMG4_SET_OMP_ILU samg4_set_omp_ilu_
#define SAMG4_GET_OMP_ILU samg4_get_omp_ilu_
#define SAMG4_ISET_OMP_PARTITION_FILE samg4_iset_omp_partition_file_
#define SAMG4_IGET_OMP_PARTITION_FILE samg4_iget_omp_partition_file_
#define SAMG4_SET_OMP_PARTITION_FILE samg4_set_omp_partition_file_
#define SAMG4_GET_OMP_PARTITION_FILE samg4_get_omp_partition_file_
#define SAMG4_SET_OMP_NUM_THREADS_EXTERNAL samg4_set_omp_num_threads_external_
#define SAMG4_GET_OMP_NUM_THREADS_EXTERNAL samg4_get_omp_num_threads_external_
#define SAMG4_SET_OMP_NTHREADS_ONLY4SPLIT samg4_set_omp_nthreads_only4split_
#define SAMG4_GET_OMP_NTHREADS_ONLY4SPLIT samg4_get_omp_nthreads_only4split_
#define SAMG4_SET_OMP_UZAWA samg4_set_omp_uzawa_
#define SAMG4_GET_OMP_UZAWA samg4_get_omp_uzawa_
#define SAMG4_SET_OPT_MATRIX_OPS samg4_set_opt_matrix_ops_
#define SAMG4_GET_OPT_MATRIX_OPS samg4_get_opt_matrix_ops_
#define SAMG4_SET_P_CMPLX_AGG_DEFAULT samg4_set_p_cmplx_agg_default_
#define SAMG4_GET_P_CMPLX_AGG_DEFAULT samg4_get_p_cmplx_agg_default_
#define SAMG4_SET_P_CMPLX_DEFAULT samg4_set_p_cmplx_default_
#define SAMG4_GET_P_CMPLX_DEFAULT samg4_get_p_cmplx_default_
#define SAMG4_SET_PARTIAL_FRAC samg4_set_partial_frac_
#define SAMG4_GET_PARTIAL_FRAC samg4_get_partial_frac_
#define SAMG4_ISET_PARTITION_FILE samg4_iset_partition_file_
#define SAMG4_IGET_PARTITION_FILE samg4_iget_partition_file_
#define SAMG4_SET_PARTITION_FILE samg4_set_partition_file_
#define SAMG4_GET_PARTITION_FILE samg4_get_partition_file_
#define SAMG4_SET_AMG_RENUMBER samg4_set_amg_renumber_
#define SAMG4_GET_AMG_RENUMBER samg4_get_amg_renumber_
#define SAMG4_ISET_AMG_RENUMBER_FILE samg4_iset_amg_renumber_file_
#define SAMG4_IGET_AMG_RENUMBER_FILE samg4_iget_amg_renumber_file_
#define SAMG4_SET_AMG_RENUMBER_FILE samg4_set_amg_renumber_file_
#define SAMG4_GET_AMG_RENUMBER_FILE samg4_get_amg_renumber_file_
#define SAMG4_ISET_DUMPFILE_RENUMBER samg4_iset_dumpfile_renumber_
#define SAMG4_IGET_DUMPFILE_RENUMBER samg4_iget_dumpfile_renumber_
#define SAMG4_SET_DUMPFILE_RENUMBER samg4_set_dumpfile_renumber_
#define SAMG4_GET_DUMPFILE_RENUMBER samg4_get_dumpfile_renumber_
#define SAMG4_SET_PERF_METER_ENABLED samg4_set_perf_meter_enabled_
#define SAMG4_GET_PERF_METER_ENABLED samg4_get_perf_meter_enabled_
#define SAMG4_SET_PRIM_NORM samg4_set_prim_norm_
#define SAMG4_GET_PRIM_NORM samg4_get_prim_norm_
#define SAMG4_SET_PRIM_PRINT samg4_set_prim_print_
#define SAMG4_GET_PRIM_PRINT samg4_get_prim_print_
#define SAMG4_SET_PRINT_NXTYP_COARSE_MSG samg4_set_print_nxtyp_coarse_msg_
#define SAMG4_GET_PRINT_NXTYP_COARSE_MSG samg4_get_print_nxtyp_coarse_msg_
#define SAMG4_SET_PRINT_SETUP_ILU_OR_DIRECT samg4_set_print_setup_ilu_or_direct_
#define SAMG4_GET_PRINT_SETUP_ILU_OR_DIRECT samg4_get_print_setup_ilu_or_direct_
#define SAMG4_SET_PRNT_STAT_SCHWARZ samg4_set_prnt_stat_schwarz_
#define SAMG4_GET_PRNT_STAT_SCHWARZ samg4_get_prnt_stat_schwarz_
#define SAMG4_SET_QUASI_ONLY samg4_set_quasi_only_
#define SAMG4_GET_QUASI_ONLY samg4_get_quasi_only_
#define SAMG4_SET_REDUCT_KCYCLE samg4_set_reduct_kcycle_
#define SAMG4_GET_REDUCT_KCYCLE samg4_get_reduct_kcycle_
#define SAMG4_SET_RBM_INTERN_INFO samg4_set_rbm_intern_info_
#define SAMG4_GET_RBM_INTERN_INFO samg4_get_rbm_intern_info_
#define SAMG4_SET_RCONDX samg4_set_rcondx_
#define SAMG4_GET_RCONDX samg4_get_rcondx_
#define SAMG4_SET_READ_UZAWA_PARMS samg4_set_read_uzawa_parms_
#define SAMG4_GET_READ_UZAWA_PARMS samg4_get_read_uzawa_parms_
#define SAMG4_SET_READ_MARIAN_COARSENING samg4_set_read_marian_coarsening_
#define SAMG4_GET_READ_MARIAN_COARSENING samg4_get_read_marian_coarsening_
#define SAMG4_SET_REFRESH_CALLED samg4_set_refresh_called_
#define SAMG4_GET_REFRESH_CALLED samg4_get_refresh_called_
#define SAMG4_SET_REL_APP_VAR samg4_set_rel_app_var_
#define SAMG4_GET_REL_APP_VAR samg4_get_rel_app_var_
#define SAMG4_SET_RHO_MIN samg4_set_rho_min_
#define SAMG4_GET_RHO_MIN samg4_get_rho_min_
#define SAMG4_SET_RHO_OK samg4_set_rho_ok_
#define SAMG4_GET_RHO_OK samg4_get_rho_ok_
#define SAMG4_SET_SHOW_UN_RES samg4_set_show_un_res_
#define SAMG4_GET_SHOW_UN_RES samg4_get_show_un_res_
#define SAMG4_ISET_SCRATCHFILE samg4_iset_scratchfile_
#define SAMG4_IGET_SCRATCHFILE samg4_iget_scratchfile_
#define SAMG4_SET_SCRATCHFILE samg4_set_scratchfile_
#define SAMG4_GET_SCRATCHFILE samg4_get_scratchfile_
#define SAMG4_SET_SLOW_COARSENING samg4_set_slow_coarsening_
#define SAMG4_GET_SLOW_COARSENING samg4_get_slow_coarsening_
#define SAMG4_SET_STABILITY samg4_set_stability_
#define SAMG4_GET_STABILITY samg4_get_stability_
#define SAMG4_SET_STRUCT_IDENT samg4_set_struct_ident_
#define SAMG4_GET_STRUCT_IDENT samg4_get_struct_ident_
#define SAMG4_SET_STRUCT_SYMM samg4_set_struct_symm_
#define SAMG4_GET_STRUCT_SYMM samg4_get_struct_symm_
#define SAMG4_SET_TAU_UZAWA samg4_set_tau_uzawa_
#define SAMG4_GET_TAU_UZAWA samg4_get_tau_uzawa_
#define SAMG4_SET_TERM_COARSENING samg4_set_term_coarsening_
#define SAMG4_GET_TERM_COARSENING samg4_get_term_coarsening_
#define SAMG4_SET_TRACE_L2_QUASI_RES samg4_set_trace_l2_quasi_res_
#define SAMG4_GET_TRACE_L2_QUASI_RES samg4_get_trace_l2_quasi_res_
#define SAMG4_SET_TRACKMEM samg4_set_trackmem_
#define SAMG4_GET_TRACKMEM samg4_get_trackmem_
#define SAMG4_SET_TRACKRESID samg4_set_trackresid_
#define SAMG4_GET_TRACKRESID samg4_get_trackresid_
#define SAMG4_SET_TRACK_AP_P samg4_set_track_ap_p_
#define SAMG4_GET_TRACK_AP_P samg4_get_track_ap_p_
#define SAMG4_SET_USE_IC samg4_set_use_ic_
#define SAMG4_GET_USE_IC samg4_get_use_ic_
#define SAMG4_SET_VIO_DD samg4_set_vio_dd_
#define SAMG4_GET_VIO_DD samg4_get_vio_dd_
#define SAMG4_SET_W_AVRGE_AGG_DEFAULT samg4_set_w_avrge_agg_default_
#define SAMG4_GET_W_AVRGE_AGG_DEFAULT samg4_get_w_avrge_agg_default_
#define SAMG4_SET_W_AVRGE_DEFAULT samg4_set_w_avrge_default_
#define SAMG4_GET_W_AVRGE_DEFAULT samg4_get_w_avrge_default_
#define SAMG4_SET_WCOUPLED samg4_set_wcoupled_
#define SAMG4_GET_WCOUPLED samg4_get_wcoupled_
#define SAMG4_SET_WFT samg4_set_wft_
#define SAMG4_GET_WFT samg4_get_wft_
#define SAMG4_SET_WLEN_SWITCHES_GALERKIN samg4_set_wlen_switches_galerkin_
#define SAMG4_GET_WLEN_SWITCHES_GALERKIN samg4_get_wlen_switches_galerkin_
#define SAMG4_SET_WRITE_CLUSTER_ID samg4_set_write_cluster_id_
#define SAMG4_GET_WRITE_CLUSTER_ID samg4_get_write_cluster_id_
#define SAMG4_SET_WTSL samg4_set_wtsl_
#define SAMG4_GET_WTSL samg4_get_wtsl_
#define SAMG4_RELEASE_INFO samg4_release_info_
#define SAMG4_VERSION_INFO samg4_version_info_
#define SAMG4_DETAILS_INFO samg4_details_info_
#endif

