openCSMP/openCSMP/lib/samg/samg4.h
////////////////
/* interfaces */
////////////////

extern "C" {
SAMG_C_CALLCONV SAMG4_GETINT_NU(APPL_INT * n);
SAMG_C_CALLCONV SAMG4_GETDBLE_NU(double * d);
SAMG_C_CALLCONV SAMG4_GETRE_NU(float * f);
SAMG_C_CALLCONV SAMG4_GETLO_NU(APPL_INT * n);
SAMG_C_CALLCONV SAMG4_GETTE_NU(char * te);
SAMG_C_CALLCONV SAMG4_GETSPEC_NU(APPL_INT * n);
}

// for resetting secondary / all hidden parameters
extern "C" {
SAMG_C_CALLCONV SAMG4_RESET_HIDDEN(void);
}

// samg4's internal timing routines
extern "C" {
SAMG_C_CALLCONV SAMG4_CTIME(float * time);
SAMG_C_CALLCONV SAMG4_CPUTIME(float * time);
SAMG_C_CALLCONV SAMG4_ALL_ERRORINFO(char * ch, APPL_INT * len);
}

// samg4 and samg4_main routines
extern "C"
SAMG_C_CALLCONV SAMG4(APPL_INT * nnu, APPL_INT * nna, APPL_INT * nsys,
          APPL_INT * ia, APPL_INT * ja, double * a, double * f, double * u,
          APPL_INT * iu, APPL_INT * ndiu, APPL_INT * ip, APPL_INT * ndip,
          APPL_INT * matrix, APPL_INT * iscale,
          double * res_in, double * res_out, APPL_INT * ncyc_done, APPL_INT * ierr,
          APPL_INT * nsolve, APPL_INT * ifirst, double * eps, APPL_INT * ncyc,
          APPL_INT * iswtch,
          double * a_cmplx, double * g_cmplx, double * p_cmplx, double * w_avrge,
          double * chktol, APPL_INT * idump, APPL_INT * iout);
extern "C"
SAMG_C_CALLCONV SAMG4_MAIN(APPL_INT * nnu, APPL_INT * nna, APPL_INT * nsys,
          APPL_INT * ia, APPL_INT * ja, double * a, double * f, double * u,
          APPL_INT * iu, APPL_INT * ndiu, APPL_INT * ip, APPL_INT * ndip,
          APPL_INT * matrix, APPL_INT * iscale,
          double * res_in, double * res_out, APPL_INT * ncyc_done, APPL_INT * ierr,
          APPL_INT * nsolve, APPL_INT * ifirst, double * eps, APPL_INT * ncyc,
          APPL_INT * iswtch,
          double * a_cmplx, double * g_cmplx, double * p_cmplx, double * w_avrge,
          double * chktol, APPL_INT * idump, APPL_INT * iout);
extern "C"
SAMG_C_CALLCONV SAMG4_DC(APPL_INT * nnu, APPL_INT * nna_i, APPL_INT * nsys, APPL_INT * ia_i, APPL_INT * ja_i,
                      double * a_i, double * f_o, double * u_o, APPL_INT * iu, APPL_INT * ndiu,
                      APPL_INT * ip, APPL_INT * ndip, APPL_INT * matrix, APPL_INT * iscale, 
                      double * res_in_o, double * res_out_o, APPL_INT * ncyc_done_o, 
                      APPL_INT * ierr, APPL_INT * nsolve, APPL_INT * ifirst, double * eps_i, 
                      APPL_INT * ncyc, APPL_INT * iswtch, double * a_cmplx, double * g_cmplx, 
                      double * p_cmplx, double * w_avrge, double * chktol, 
                      APPL_INT * idump, APPL_INT * iout, APPL_INT * nna_o, APPL_INT * ia_o, APPL_INT * ja_o, 
                      double * a_o, APPL_INT * nkdim_dc, double * eps_dc, APPL_INT * ncycle_dc );

// samg4's simple intterface
extern "C"
SAMG_C_CALLCONV SAMG4_SIMPLE(APPL_INT * iounit, APPL_INT * nnu, APPL_INT * nna, APPL_INT * nsys,
          APPL_INT * ia, APPL_INT * ja, double * a, double * f, double * u,
          APPL_INT * iu, APPL_INT * ndiu, APPL_INT * ip, APPL_INT * ndip, APPL_INT * matrix, APPL_INT * iscale,
          double * res_in, double * res_out, APPL_INT * ncyc_done, APPL_INT * ierr);

// certain other routines
extern "C"
{
SAMG_C_CALLCONV SAMG4_LEAVE(APPL_INT * val);
SAMG_C_CALLCONV SAMG4_REFRESH(APPL_INT * val);
SAMG_C_CALLCONV SAMG4_CLEANUP(void);
SAMG_C_CALLCONV SAMG4_GET_COMPLEXITIES(APPL_INT * istat, double * valcmplx);
SAMG_C_CALLCONV SAMG4_GET_NFLAG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_SET_NFLAG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_GET_NFLAGO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_SET_NFLAGO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_GET_NFLAGP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_SET_NFLAGP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_GET_NFLAGS(APPL_INT *ival, APPL_INT *jva);
SAMG_C_CALLCONV SAMG4_SET_NFLAGS(APPL_INT *ival, APPL_INT *jva);
SAMG_C_CALLCONV SAMG4_GET_LEVELS_CREATED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_GET_LEVELS_USED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_GET_MEM_ACTIVE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG4_GET_LEV_SIZES(APPL_INT *nlev, APPL_INT * lev_sizes);
SAMG_C_CALLCONV SAMG4_GET_TIME_AND_MEM(APPL_INT *istat, double *valtime, double *valmem);
SAMG_C_CALLCONV SAMG4_EXTRAPRINT(void);
SAMG_C_CALLCONV SAMG4_FLUSH(APPL_INT * iunit);
SAMG_C_CALLCONV SAMG4_CVEC_ALLOC(APPL_INT *nproc, APPL_INT *val1, APPL_INT *val2);
SAMG_C_CALLCONV SAMG4_CVEC_DEALLOC(APPL_INT *val);
SAMG_C_CALLCONV SAMG4_CVEC_SET(APPL_INT *val1, APPL_INT *val2, APPL_INT *val3);
SAMG_C_CALLCONV SAMG4_CVEC_GET(APPL_INT *val1, APPL_INT *val2, APPL_INT *val3);
SAMG_C_CALLCONV SAMG4_PERFINIT(void);
SAMG_C_CALLCONV SAMG4_PERFOUT(void);
SAMG_C_CALLCONV SAMG4_PARALLEL_LIB(APPL_INT * ipara);
SAMG_C_CALLCONV SAMG4_LRATIO(APPL_INT * lratio);
SAMG_C_CALLCONV SAMG4_MEM_INFO(void);
SAMG_C_CALLCONV SAMG4_ADDTIME(float * tres, float * told, float * tnew);
SAMG_C_CALLCONV SAMG4_COMPTIME(float * tres, float * told, float * tnew);
SAMG_C_CALLCONV SAMG4_COPY_GALERKIN(APPL_INT * nnu, APPL_INT * nna, double * a, APPL_INT * ia, APPL_INT * ja, APPL_INT * levels_user  );
SAMG_C_CALLCONV SAMG4_OMEGA_JACOBI_ALLOC(APPL_INT * nsys, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_OMEGA_JACOBI_SET(APPL_INT * npos, double * val, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_OMEGA_JACOBI_DEALLOC(APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_CURRENT_RESIDUAL(APPL_INT *ncycle, double *residual);
SAMG_C_CALLCONV SAMG4_OPEN_LOGFILE(bool *opened_file, APPL_INT *ierr);
SAMG_C_CALLCONV SAMG4_CLOSE_LOGFILE(APPL_INT *ierr);
SAMG_C_CALLCONV SAMG4_COO_VEC_SET(APPL_INT *i, double *x, double * y, double * z, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_COO_VEC_ALLOC(APPL_INT *ndim, APPL_INT *nnu, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_COO_VEC_DEALLOC(APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_IDEC(APPL_INT * int0, APPL_INT * nnum, APPL_INT * ndigit, APPL_INT * iarr);
SAMG_C_CALLCONV SAMG4_PROPOSE_NSYS_ISCALE_IU(APPL_INT * iscale_new,APPL_INT * iu_new,APPL_INT * nsys_new,
                  APPL_INT * iout_level,APPL_INT * io, 
                  APPL_INT * imin,APPL_INT * imax,APPL_INT * nna,APPL_INT * iscale,APPL_INT * matrix,APPL_INT * iu,APPL_INT * nsys, 
                  APPL_INT * ia, APPL_INT * ja, double * a, APPL_INT * imodified, 
                  APPL_INT * ic_set_strategy,APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_USED_OMP_THREADS(APPL_INT * nthr_used, APPL_INT * nthr_avail);
SAMG_C_CALLCONV SAMG4_GET_INNERMAX(APPL_INT * ilev, APPL_INT * ival);
SAMG_C_CALLCONV SAMG4_SET_INNERMAX(APPL_INT * ilev, APPL_INT * ival);
SAMG_C_CALLCONV SAMG4_DRV_SET_INNERMAX(APPL_INT * ilev, APPL_INT * ival);
SAMG_C_CALLCONV SAMG4_GET_NUM_SMOOTH_VECTORS(APPL_INT * nsmooth);
SAMG_C_CALLCONV SAMG4_SMOOTH_VECTOR_INIT(APPL_INT * nnu, APPL_INT * nhal, APPL_INT * ndrbm, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_SMOOTH_VECTOR_SET(APPL_INT * i, APPL_INT * j, double * val, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_SMOOTH_VECTOR_GET(APPL_INT * i, APPL_INT * j, double * val, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_GET_NUM_DEFLATION_VECTORS(APPL_INT * nsmooth);
SAMG_C_CALLCONV SAMG4_DEFLATION_VECTOR_INIT(APPL_INT * nnu, APPL_INT * ndrbm, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_DEFLATION_VECTOR_SET(APPL_INT * i, APPL_INT * j, double * val, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_DEFLATION_VECTOR_GET(APPL_INT * i, APPL_INT * j, double * val, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_USER_CHECK(double * tol,APPL_INT * nnu,APPL_INT * nna,APPL_INT * iscale,APPL_INT * nsys, 
                     APPL_INT * npnts,APPL_INT * nstyp, double * a,APPL_INT * ia,APPL_INT * ja, 
                     double * f,APPL_INT * iu,APPL_INT * ndiu,APPL_INT * ip,APPL_INT * ndip);
SAMG_C_CALLCONV SAMG4_USER_CLEANUP(void);
SAMG_C_CALLCONV SAMG4_USER_SOLVE(APPL_INT * ilo,APPL_INT * ihi, double * a,APPL_INT * ia, 
                           APPL_INT * ja, double * u, double * f, 
                           APPL_INT * ndu_low,APPL_INT * nda_low,APPL_INT * ndu_hig,APPL_INT * nda_hig, 
                           APPL_INT * ideco_required,APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4(APPL_INT * nnu, APPL_INT * nna, APPL_INT * nsys,
                APPL_INT * ia, APPL_INT * ja, double * a, double * f, double * u,
                APPL_INT * iu, APPL_INT * ndiu, APPL_INT * ip, APPL_INT * ndip,
                APPL_INT * matrix, APPL_INT * iscale,
                double * res_in, double * res_out, APPL_INT * ncyc_done, APPL_INT * ierr,
                APPL_INT * nsolve, APPL_INT * ifirst, double * eps, APPL_INT * ncyc,
                APPL_INT * iswtch,
                double * a_cmplx, double * g_cmplx, double * p_cmplx, double * w_avrge,
                double * chktol, APPL_INT * idump, APPL_INT * iout);
SAMG_C_CALLCONV XSAMG4_DC(APPL_INT * nnu, APPL_INT * nna_i, APPL_INT * nsys, APPL_INT * ia_i, APPL_INT * ja_i,
                      double * a_i, double * f_o, double * u_o, APPL_INT * iu, APPL_INT * ndiu,
                      APPL_INT * ip, APPL_INT * ndip, APPL_INT * matrix, APPL_INT * iscale, 
                      double * res_in_o, double * res_out_o, APPL_INT * ncyc_done_o, 
                      APPL_INT * ierr, APPL_INT * nsolve, APPL_INT * ifirst, double * eps_i, 
                      APPL_INT * ncyc, APPL_INT * iswtch, double * a_cmplx, double * g_cmplx, 
                      double * p_cmplx, double * w_avrge, double * chktol, 
                      APPL_INT * idump, APPL_INT * iout, APPL_INT * nna_o, APPL_INT * ia_o, APPL_INT * ja_o, 
                      double * a_o, APPL_INT * nkdim_dc, double * eps_dc, APPL_INT * ncycle_dc );
SAMG_C_CALLCONV XSAMG4_START(APPL_INT * icase,     APPL_INT * mpiinitialize,APPL_INT * mpifinalize,
                            APPL_INT * nulldevice,APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_START_IUM(APPL_INT *  icase,APPL_INT *  mpiinitialize,APPL_INT *  mpifinalize,
                               APPL_INT *  ium,APPL_INT *  nd,APPL_INT *  nulldevice,APPL_INT *  ierr);
SAMG_C_CALLCONV XSAMG4_START_LINUX(APPL_INT* iuser_run_mode, APPL_INT* io_mode, APPL_INT* ierr);
SAMG_C_CALLCONV XSAMG4_START_USER_CTRL( APPL_INT* ixsamg4_do_user_code, APPL_INT* ixsamg4_do_xsamg4_call);
SAMG_C_CALLCONV XSAMG4_START_SOLVER(APPL_INT * operating_system,APPL_INT * host_worker_model,
           APPL_INT * io_units,APPL_INT * n_units,APPL_INT * host_ok,APPL_INT * slave_ok,APPL_INT * error_code);
SAMG_C_CALLCONV XSAMG4_END_SOLVER(APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_FINALIZE(APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_END(APPL_INT * mpifinalize, APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_GET_LOGIO(APPL_INT * io);
SAMG_C_CALLCONV XSAMG4_GET_SLAVE_RETURNCODE(APPL_INT * iret);
SAMG_C_CALLCONV XSAMG4_PROCESS_INFO(APPL_INT * myrank,APPL_INT * nprocs,APPL_INT * nprocs_used);
SAMG_C_CALLCONV XSAMG4_GET_INTERNAL_TIMER(float * tim);
SAMG_C_CALLCONV XSAMG4_MPI_INIT(APPL_INT *ierr);
SAMG_C_CALLCONV XSAMG4_MPI_FINALIZE(APPL_INT *ierr);
SAMG_C_CALLCONV XSAMG4_MPI_COMM_RANK(APPL_INT * mcommworld, APPL_INT * myrank, APPL_INT *ierr);
SAMG_C_CALLCONV XSAMG4_GET_MPI_COMM_WORLD(APPL_INT * mcommworld);
SAMG_C_CALLCONV XSAMG4_GET_PARALLEL_RUN(APPL_INT *ierr);
SAMG_C_CALLCONV XSAMG4_IO_SETTINGS(APPL_INT * iunit,APPL_INT * icase,APPL_INT * ioutcase,APPL_INT * ium,
                                  APPL_INT * nd,APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_IO_SETTINGS2(APPL_INT * iunit,APPL_INT * myrank,APPL_INT * icase,APPL_INT * ioutcase, 
                                   APPL_INT * ium,APPL_INT * nd,APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_LAST_MSG(APPL_INT * nprocs,APPL_INT * nprocs_used,APPL_INT * myrank);
SAMG_C_CALLCONV XSAMG4_READ_CONFIG(APPL_INT * iunit,APPL_INT * icase,APPL_INT * mpiinitialize,
                      APPL_INT * mpifinalize,APPL_INT * ioutcase,APPL_INT * nulldevice,APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_PRINT_INTERNAL_TIMER(float * tamg,APPL_INT * ium);
SAMG_C_CALLCONV XSAMG4_ERROR_INFO(APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_GET_IERR_ON_TAG_STOP(APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_CONFIGFILE_MISSING(void);
SAMG_C_CALLCONV XSAMG4_LEAVE(APPL_INT * ierr);
SAMG_C_CALLCONV XSAMG4_CLEANUP(void);
SAMG_C_CALLCONV SAMG4_ARRAY_OFFSET(APPL_INT * ishift, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_DUMP_SEQUENCE_RESET(APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_GET_RESIDUAL_VECTOR_E(APPL_INT * i, double * val, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_GET_RESIDUAL_VECTOR_V(APPL_INT * nnu, double * vec, APPL_INT *ierr);
SAMG_C_CALLCONV SAMG4_SET_RESIDUAL_VECTOR_E(APPL_INT * i, double * val, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_SET_RESIDUAL_VECTOR_V(APPL_INT * nnu, double * vec, APPL_INT *ierr);
SAMG_C_CALLCONV SAMG4_RESIDUAL_VECTOR_LEAVE(APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_SET_RESIDUAL_VECTOR_INIT(APPL_INT * nnu, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_SET_RENUMBER_VEC(APPL_INT * iuser_partition_vec, APPL_INT * ilen_in, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_GET_RENUMBER_VEC(APPL_INT * iuser_partition_vec, 
                                      APPL_INT * ilen_in, APPL_INT * ilen_out, APPL_INT * ierr);
SAMG_C_CALLCONV SAMG4_RELEASE_INFO(APPL_INT * ilanguage,void * release_out, APPL_INT * len_main,
                                                       void * details_out, APPL_INT * len_details);
SAMG_C_CALLCONV SAMG4_VERSION_INFO(APPL_INT * ilanguage,void * release_out, APPL_INT * len_main);
SAMG_C_CALLCONV SAMG4_DETAILS_INFO(APPL_INT * ilanguage,void * details_out, APPL_INT * len_details);
}

// samg4_oil routines
extern "C"
SAMG_C_CALLCONV SAMG4_OIL(APPL_INT * nnu, APPL_INT * nna, APPL_INT * nsys,
          APPL_INT * ia, APPL_INT * ja, double * a, double * f, double * u,
          APPL_INT * iu, APPL_INT * ndiu, APPL_INT * ip, APPL_INT * ndip,
          APPL_INT * matrix,
          double * res_in, double * res_out, APPL_INT * ncyc_done, APPL_INT * ierr,
          APPL_INT * ifirst, double * eps, APPL_INT * ncyc,
          APPL_INT * iswtch,
          double * a_cmplx, double * g_cmplx, double * p_cmplx, double * w_avrge,
          double * chktol, APPL_INT * idump, APPL_INT * iout,
          APPL_INT * nunknown_description, APPL_INT * noil_approach, APPL_INT * noil_cyc, double * noil_preparation);
extern "C"
SAMG_C_CALLCONV XSAMG4_OIL(APPL_INT * nnu, APPL_INT * nna, APPL_INT * nsys,
          APPL_INT * ia, APPL_INT * ja, double * a, double * f, double * u,
          APPL_INT * iu, APPL_INT * ndiu, APPL_INT * ip, APPL_INT * ndip,
          APPL_INT * matrix,
          double * res_in, double * res_out, APPL_INT * ncyc_done, APPL_INT * ierr,
          APPL_INT * ifirst, double * eps, APPL_INT * ncyc,
          APPL_INT * iswtch,
          double * a_cmplx, double * g_cmplx, double * p_cmplx, double * w_avrge,
          double * chktol, APPL_INT * idump, APPL_INT * iout,
          APPL_INT * nunknown_description, APPL_INT * noil_approach, APPL_INT * noil_cyc, double * noil_preparation);

